{
  "result": "Virgin Voyages Reorganizes Trade-Focused Sales Structure, Hires Koreen McNuttbyDori SaltzmanMay 29, 2025(l-r) Koreen McNutt, Kristy Woolums, and Stephen Hopkins.Virgin Voyages is expanding and reorganizing its trade-focused sales structure with the hiring of Koreen McNutt as vice president of agency and business development. The hiring of McNutt u2013 and promotions of Kristy Woolums and Stephen Hopkins u2013 is part of a newly launched integrated commercial approach designed to provide enhanced support, specialized expertise, and accelerated opportunities for Virgin Voyagesu2019 First Mate (travel advisor) partners.The enhancements come as Virginu2019s trade channel continues to deliver year-over-year growth.u201cDuring First Mate Appreciation Month, thereu2019s no better time to announce these investments in building our partnershipu2019s future together,u201d saidu00a0Nirmal Saverimuttu, CEO of Virgin Voyages. u201cFirst Mates arenu2019t just important to Virgin Voyages u2014 they are key to our growth and future. Our sold-out Ultimate First Mate Voyage demonstrates the incredible strength of this partnership, and these leadership appointments reflect our commitment to the advisors who have helped us build this company from day one. As we always say, feedback is a gift, and their success has taught us exactly where to invest next.u201dMcNutt joins Virgin Voyages from MSC Cruises, where she served as senior vice president and commercial officer. Prior to MSC Cruises, she spent 16 years at Expedia Group, rising to senior director of global cruise supply. She also spent 13 years at Holland America Line/Windstar Cruises.u201cVirgin Voyages has consistently proven their commitment to travel advisors isnu2019t just talk u2014 itu2019s built into their DNA,u201du00a0said McNutt. u201cWhat I love about this company is their authentic approach to building partnerships. Iu2019m excited to accelerate the incredible foundation theyu2019ve created and develop more innovative ways to support advisor success as we build this company together.u201dSimultaneous to McNuttu2019s hiring, Virgin Voyages has promoted Kristy Woolums to the role of senior director of national strategic accounts, North America. She will focus exclusively on high-value strategic partnerships, providing the dedicated attention and leadership focus that these relationships require. She will also serve as the cruise lineu2019s key representative at major events and industry get-togethers, ensuring Virgin Voyages maintains strong visibility.According to the cruise line, this newly created position u201crecognizes the critical importance of national account relationships in driving strategic growth, market positioning, and long-term brand value.Also expanding his role is vice president of growth and international sales and marketing, Stephen Hopkins, who will also take on sales acceleration, under the guidance of chief marketing officeru00a0Nathan Rosenberg. In this enhanced capacity, he will oversee the integration of sales enablement, trade marketing, and partner engagement initiatives u2014 all designed to deliver stronger tools, more streamlined support, and enhanced resources for Virgin Voyagesu2019 global network of travel partners.By bringing these key commercial functions together under one leader, Virgin Voyages is creating a more unified and efficient approach to driving partner success. This structure allows for improved alignment across marketing channels, more cohesive campaign execution, and greater ease of access to the tools and support travel advisors need to convert business and grow their Virgin Voyages sales.u201cThe enhanced structure creates a unified commercial team under chief marketing officeru00a0Nathan Rosenbergu2019sleadership, breaking down traditional silos between sales and marketing to ensure First Mates receive cohesive support across all touchpoints,u201d the line said in its announcement of the hiring and promotions.u201cBy working in better coordination across our brand\n"
}