[
  {
    "alert_name": "Google Alert - Chief Marketing Officer Hiring",
    "date": "2025-05-30",
    "url": "https://www.bizjournals.com/austin/inno/stories/news/2025/05/30/austin-tech-startup-hiring-roundup-may-2025.html",
    "title": "Title not found",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Chief Marketing Officer Hiring",
    "date": "2025-05-30",
    "url": "https://abcnews.go.com/Business/wireStory/new-york-mets-hire-lew-sherr-us-open-122350431",
    "title": "New York Mets hire Lew Sherr from the US Open tennis tournament as president of business operations",
    "content": "ABC NewsVideoLiveShowsShopStream onNew York Mets hire Lew Sherr from the US Open tennis tournament as president of business operationsThe New York Mets are hiring U.S. Tennis Association CEO Lew Sherr as their new president of business operationsByHOWARD FENDRICH AP national writerMay 30, 2025, 12:01 PM1:20FILE - CEO and Executive Director of USTA Lew Sherr, speaks at a news conference in New York, Monday, May 19, 2025,. (AP Photo/Stefan Jeremiah, File)The Associated PressPARIS --TheNew York Metsare hiring the person who oversees theU.S. Opentennis tournament, Lew Sherr, as their new president of business operations.Sherr has been the CEO and executive director of the U.S. Tennis Association since 2022 and has worked there since 2010, including previously as chief revenue officer. His departure was announced by the USTA on Friday; he will remain there until the end of June, then start with the Mets in July.“For right now, my focus is the smoothest possible transition,” Sherr said in an interview with The Associated Press at theFrench Open. “But I'm hugely excited about what's happening over there. (Mets owners) Steve and Alex Cohen have made a commitment to that team that is unrivaled in sports. You see it on the field, off the field. The energy around the team. The energy around what they’re trying to do for the community with their foundation. The plans for the casino and the hotel and entertainment district.”Steve Cohenis among the bidders for three casino licensesto be awarded by the New York State Gaming Commission and has been lobbying to have the state legislature reclassify the parking lots adjacent to Citi Field — also near the facility that hosts the U.S. Open — from parkland to commercial land for a gaming facility.The Mets announced Scott Havens' departure as their president of business operations on Tuesday; he was in that post since December 2023. Chief legal officer Katie Pothier, chief marketing officer Andy Goldberg, chief communications officer Nancy Elder and senior vice president of finance Peter Woll have left since November.The USTA said Brian Vahaly and Andrea Hirsch will be interim co-CEOs during a search for Sherr's replacement. Vahaly is chairman of the USTA Board; Hirsch is the USTA's chief operating officer and chief legal officer.In Sherr's time as CEO, the USTA has seen growth in tennis participation around the country, along with increases in U.S. Open attendance, sponsorships, and revenue from ticket sales and broadcasting rights.“We’ve taken some big swings,\" Sherr said Friday, “and thankfully, they’re paying off.”Just last week, he spoke at a news conference in New York to unveilan $800 million projectto update Arthur Ashe Stadium and create a player performance center on the tournament grounds. He also made significant changes to this year'sU.S. Open mixed doubles eventin a bid to attract top singles players, making it a two-day, 16-team competition the week before the singles brackets begin.“It’s bittersweet, in that I really have loved being part of this organization for 15 years and the opportunities I've had to do just really interesting things — and not just on the commercial side, but in terms of helping us think about growing the sport,” Sherr said. \"I’m leaving sleeping well at night, knowing (the USTA) is going to be well looked-after.”___AP Baseball Writer Ronald Blum in New York contributed.___Howard Fendrich is an AP national writer. Find his stories here:https://apnews.com/author/howard-fendrich. AP MLB:https://apnews.com/hub/mlbSponsored Content by TaboolaPopular ReadsTrump admin live updates: Trump says he's doubling steel tariff to 50%May 30, 2:51 PMTrump calls Putin 'crazy,' warns of Russia's 'downfall'May 25, 9:35 PMAppeals court reinstates Trump's tariffs for now after ruling blocking themMay 29, 9:33 PMSean 'Diddy' Combs trial updates: Ex-assistant 'Mia' to continue testimony next weekMay 30, 4:25 PMABC News Live24/7 coverage of breaking news and live eventsABC News NetworkPrivacy PolicyYour US State Privacy RightsChildren's Online Privacy PolicyInterest-Based AdsAbout Nielsen MeasurementTerms of UseDo Not Sell or Share My Personal InformationContact Us©2025ABC News"
  },
  {
    "alert_name": "Google Alert - Chief Marketing Officer Hiring",
    "date": "2025-05-30",
    "url": "https://theday.com/news/748955/new-york-mets-hire-lew-sherr-from-the-us-open-tennis-tournament-as-president-of-business-operations/",
    "title": "New York Mets hire Lew Sherr from the US Open tennis tournament as president of business operations",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://www.businesswire.com/news/home/20250530793892/en/Nebius-participates-in-ClickHouse-Series-C-crystallizes-value-of-asset-to-fund-hypergrowth-of-core-AI-infrastructure-business",
    "title": "HTTP 403",
    "content": "Failed to access https://www.businesswire.com/news/home/20250530793892/en/Nebius-participates-in-ClickHouse-Series-C-crystallizes-value-of-asset-to-fund-hypergrowth-of-core-AI-infrastructure-business: 403 Client Error: Forbidden for url: https://www.businesswire.com/news/home/20250530793892/en/Nebius-participates-in-ClickHouse-Series-C-crystallizes-value-of-asset-to-fund-hypergrowth-of-core-AI-infrastructure-business"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://finance.yahoo.com/news/nebius-participates-clickhouse-series-c-135100182.html",
    "title": "Yahoo Finance",
    "content": "Nebius participates in ClickHouse Series C; crystallizes value of asset to fund hypergrowth of core AI infrastructure businessBusiness WireFri, May 30, 2025, 7:21 PM2 min readIn This Article:NBIS-3.39%AMSTERDAM, May 30, 2025--(BUSINESS WIRE)--Nebius Group (\"Nebius\" or \"the Group\"; NASDAQ: NBIS), a leading AI infrastructure company, today confirmed its participation in ClickHouse’s Series C funding round.Arkady Volozh, founder and CEO of Nebius, said:\"We are extremely impressed with what Aaron and his team have achieved to date, and believe they are well positioned to continue scaling rapidly and create significant additional value for shareholders.\"We believe our non-core assets will provide us with billions of dollars to invest in our core AI infrastructure business. We expect these non-core businesses to continue to grow significantly, and will look to utilize the stakes as funding sources over time for our core AI infrastructure business.\"This, combined with our access to global capital markets and strong cash position, puts us in a unique position in our sector. We plan to use all these options to support the hypergrowth of our core business, and to meet strong and growing demand.\"We have a clear plan to scale our business to multiple billions of dollars in revenue in the medium term, with strong and sustainable margins, and continue to execute on it successfully.\"About NebiusNebius is a technology company building full-stack infrastructure to service the explosive growth of the global AI industry, including large-scale GPU clusters, an AI-native cloud platform, and tools and services for developers. Headquartered in Amsterdam and listed on Nasdaq, the Company has a global footprint with R&D hubs across Europe, North America and Israel.Nebius Group’s core business is an AI cloud platform built from the ground up for intensive AI workloads. With proprietary cloud software architecture and hardware designed in-house, Nebius gives AI builders the compute, storage, managed services and tools they need to build, tune and run their models.Nebius Group also operates additional businesses under their own distinctive brands:Avride — one of the most experienced teams developing autonomous driving technology for self-driving cars and delivery robots.TripleTen — a leading edtech player in the U.S. and certain other markets, re-skilling people for careers in tech;The Nebius Group also holds equity stakes in other businesses including ClickHouse and Toloka, an AI data solutions business.To learn more please visitwww.nebius.com.DisclaimerForward Looking StatementsThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which involve risks and uncertainties. All statements contained in this press release other than statements of historical facts, including, without limitation, statements regarding the future prospects for our equity stakes, our future financial and business performance, our business and strategy, expected growth, planned investments and capital expenditure, capacity expansion plans, anticipated future financing transactions and expected financial results, are forward-looking statements. The words \"anticipate,\" \"believe,\" \"continue,\" \"estimate,\" \"expect,\" \"guide,\" \"intend,\" \"likely,\" \"may,\" \"will\" and similar expressions and their negatives are intended to identify forward-looking statements.Story continuesThese forward-looking statements are subject to risks, uncertainties and assumptions, some of which are beyond our control. Actual results may differ materially from the results predicted or implied by such statements, and our reported results should not be considered as an indication of future performance. The potential risks and uncertainties that could cause actual results to differ from the results predicted or implied by such statements include, among others: our ability to build our businesses to the desired scale, competitive pressures, technological developments, our ability to secure and retain clients, our ability to secure capital to accommodate the growth of the business, unpredictable sales cycles, potential pricing pressures, and the ability of companies in which we hold minority equity stakes to achieve their business goals, as well as those risks and uncertainties related to our continuing businesses included under the captions \"Risk Factors\" and \"Operating and Financial Review and Prospects\" in our Annual Report on Form 20-F for the year ended December 31, 2024, filed with the Securities and Exchange Commission (\"SEC\") on April 30, 2025, which are available on our investor relations website athttps://group.nebius.com/sec-filingsand on the SEC website athttps://www.sec.gov/. All information in this press release is as of May 30, 2025 (unless stated otherwise). Except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.In addition, statements that \"we believe\" and similar statements reflect our beliefs and opinions on the relevant subject. These statements are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain, and investors are cautioned not to unduly rely upon these statements.View source version on businesswire.com:https://www.businesswire.com/news/home/20250530793892/en/ContactsFor journalists:media@nebius.comFor investors:askIR@nebius.comTermsandPrivacy PolicyPrivacy DashboardMore InfoRecommended stories"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/",
    "title": "HTTP 403",
    "content": "Failed to access https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/: 403 Client Error: Forbidden for url: https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "http://www.webdisclosure.com/article/nebius-group-invests-in-clickhouses-series-c-funding-tJX5QdqHxyI",
    "title": "Nebius Group Invests in ClickHouse's Series C Funding",
    "content": "BRIEFpublished on 05/30/2025 at 15:10on Yandex N.V. (NASDAQ:YNDX)Nebius Group Invests in ClickHouse's Series C FundingNebius Group has confirmed its participation in ClickHouse's Series C funding round to bolster its core AI infrastructure business. The Amsterdam-based company, led by founder and CEO Arkady Volozh, aims to leverage non-core assets to generate substantial funding. This is intended to support the hypergrowth of its AI operations.The Group plans to utilize its access to global capital markets and a strong cash position to sustain growth and meet increasing demand. Nebius aims to scale its business to multiple billions in revenue within the medium term, maintaining sustainable margins.Beyond AI infrastructure, Nebius holds stakes in businesses like ClickHouse and Toloka, enhancing its financial strategy and positioning.R. H.Copyright © 2025FinanzWire, all reproduction and representation rights reserved.Disclaimer: although drawn from the best sources, the information and analyzes disseminated by FinanzWire are provided for informational purposes only and in no way constitute an incentive to take a position on the financial markets.Series C FundingAI InfrastructureArkady VolozhNebiusClickHouseClick hereto consult the press release on which this article is basedSee all Yandex N.V. news"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://siliconangle.com/2025/05/30/prepared-raises-80m-expand-ai-powered-emergency-response-platform/",
    "title": "A message from John Furrier, co-founder of SiliconANGLE:",
    "content": "UPDATED 12:00 EDT/MAY 30 2025AIPrepared raises $80M to expand AI-powered emergency response platformbyDuncan RileySHAREPrepared, a startup offering artificial intelligence-powered solutions for emergency response, revealed today that it has raised $80 million in new funding.It plans to use the money to accelerate the development and deployment of its assistive AI platform for emergency response, expand its reach to more public safety agencies, and enhance features such as real-time translation, automated call triage and quality assurance tools.Founded in 2019, Prepared offers assistive AI technology designed to modernize emergency response systems across the U.S. The company works with more than 1,000 public safety agencies in 49 states to help protect nearly 100 million people with its AI-driven solutions tailored for 911 call centers and emergency services.Prepared’s platform is designed to streamline the entire emergency response workflow, from the moment a call is received to final dispatch and post-call review. The platform integrates tools such as automated triage, real-time translation and location services into a single-screen interface that supports faster, more informed decision-making by 911 and other emergency services operators.One key feature of the platform is Automated Non-Emergency Triage, a feature that reduces the volume of non-urgent calls handled by 911 centers and, in doing so, frees up human operators to focus on life-threatening situations. Another particularly handy feature is Assistive Call-Taking, which transcribes and translates calls in real-time to allow for rapid response when callers can’t or struggle with speaking English.“Any 911 call could be someone’s worst moment,” said Chief Executive Michael Chime. “At Prepared, our mission is to help ensure every emergency, every worst moment, gets a perfect response.”The Series C round was led by General Catalyst Group Management, with returning investors Andreessen Horowitz, First Round Capital LP and new investor Radical Ventures LP also participating.“Prepared is using applied AI in the real world, where the stakes are literally life and death,” said General Catalyst partner Mark Crane. “Equally important, they’re supporting 911 operators who help citizens in their most difficult moments. The mission aligns closely with our work in sectors like healthcare and defense.”The new funding takes the amount raised by Prepared to approximately $135.2 million, based on datafrom Tracxn.Photo: PreparedA message from John Furrier, co-founder of SiliconANGLE:Your vote of support is important to us and it helps us keep the content FREE.One click below supports our mission to provide free, deep, and relevant content.Join our community on YouTubeJoin the community that includes more than 15,000 #CubeAlumni experts, including Amazon.com CEO Andy Jassy, Dell Technologies founder and CEO Michael Dell, Intel CEO Pat Gelsinger, and many more luminaries and experts.“TheCUBE is an important partner to the industry. You guys really are a part of our events and we really appreciate you coming and I know people appreciate the content you create as well” – Andy JassyTHANK YOULATEST STORIESReady for a post-quantum world? The time to start is nowCloud cost optimization startup CloudZero closes $56M investmentHugging Face introduces two open-source robot designsPerplexity introduces Labs: a new tool that creates spreadsheets, dashboards and web appsPrepared raises $80M to expand AI-powered emergency response platformNvidia and Dell shine on earnings, Salesforce bags Informatica, and yes, AI will kill jobsLATEST STORIESReady for a post-quantum world? The time to start is nowEMERGING TECH- BYGUEST AUTHOR.1 MIN AGOCloud cost optimization startup CloudZero closes $56M investmentCLOUD- BYMARIA DEUTSCHER.19 HOURS AGOHugging Face introduces two open-source robot designsAI- BYMARIA DEUTSCHER.21 HOURS AGOPerplexity introduces Labs: a new tool that creates spreadsheets, dashboards and web appsAI- BYKYT DOTSON.24 HOURS AGOPrepared raises $80M to expand AI-powered emergency response platformAI- BYDUNCAN RILEY.1 DAY AGONvidia and Dell shine on earnings, Salesforce bags Informatica, and yes, AI will kill jobsAI- BYROBERT HOF.1 DAY AGO"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://www.dbta.com/Editorial/News-Flashes/ClickHouse-Secures-350M-for-AI-Enabling-Analytics-Database-169768.aspx",
    "title": "ClickHouse Secures $350M for AI-Enabling Analytics Database",
    "content": "ClickHouse Secures $350M for AI-Enabling Analytics DatabaseMay 30, 2025BySydney BlanchardClickHouse, Inc., a leader in real-time analytics, data warehousing, observability, and AI/ML, is announcing that its Series C financing round—which was led by Khosla Ventures with participation from new investors BOND, IVP, Battery Ventures, and Bessemer Venture Partners—has raised $350 million. Clickhouse’s funding will be leveraged to scale product development, support global expansion, and deepen its customer and technology provider relationships.ClickHouse offers a high-performance, columnar storage engine and analytical database designed for empowering AI and ML applications with interactive analytical queries across massive datasets with minimal latency. Rivaling traditional databases and warehouses struggling to keep up with the demand that AI—particularly, AI agents—have introduced, ClickHouse offers a purpose-built solution that merges high-performance analytics with the scalability and concurrency that AI and ML apps need.“As AI agents proliferate across data-driven applications, observability, data infrastructure, and beyond, the demand for agent-facing databases like ClickHouse has reached an inflection point. The future of analytics isn’t just dashboards. It’s intelligent agents that interpret data, trigger workflows, and power real-time decisions,” said Aaron Katz, CEO of ClickHouse. “But AI is just one driver. We designed and built ClickHouse from day one to support a broad spectrum of real-time data applications across industries, and our momentum reflects that enterprises are hungry for a platform that can keep up with their scaling ambitions.”The company’s latest infusion of capital brings its total funding to more than $650 million—paired with a $100 million credit facility led by Stifel and Goldman Sachs. The investments in ClickHouse reflect both the company’s value prop and its accelerated momentum, having grown 300% over the past year.“We invested in ClickHouse because they’re solving one of the most important infrastructure challenges of this era of AI and agents: enabling real-time data platforms that can support both traditional analytics and the growing demands of AI-native workloads,” said Ethan Choi, partner at Khosla Ventures. “As AI reshapes every industry, the ability to deliver fast, scalable, and cost-efficient analytics is becoming foundational, ClickHouse is poised to become the default engine for next-generation intelligent data products.”To learn more about ClickHouse, please visithttps://clickhouse.com/."
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://www.govtech.com/biz/911-tech-firm-prepared-raises-80m-as-it-touts-ai-tools",
    "title": "911 Tech Firm Prepared Raises $80M as It Touts AI Tools",
    "content": "GovTech Biz911 Tech Firm Prepared Raises $80M as It Touts AI ToolsPrepared, launched in 2019, is gaining ground with its assistive AI tools for emergency dispatchers. Andreessen Horowitz again invested in the young company, known for its livestreaming and translation tech.May 30, 2025 •Thad RueterFacebookLinkedInTwitterPrintEmailPrepared, a 911 tech supplier focused onassistive artificial intelligence, has raised $80 million in a funding round involving one of thebiggest venture capital firms in the world.Prepared has now raised more than $130 million as it brings more AI power to 911 operators, part of thenationwide pushtoupgrade emergency dispatch technology.Prepared launched in 2019.This newly completed Series C funding round was led by General Catalyst, with venture capital giantAndreessen Horowitzand First Round Capital, both previous investors, also taking part. Like General Catalyst, Radical Ventures joined the round as a new investor in Prepared.The company has launched 911 livestreaming tools andtwo-way audio translationas it touts the ability of its technology to ease the burdens of 911 call takers and help make emergency responses quicker and more efficient.Increased 911 call volumesand the difficulty of hiring emergency call operators stand as one of the selling points for the company, according to CEO Michael Chime.As he sees it, AI promises to take on more work in emergency dispatch to help ease those problems, and to better deal with a mobile, digital and multilingual population.Not only that, he toldGovernment Technology, but “AI can listen to every single call and give you insights about where you are doing well and where you are not doing so great. There are a ton of opportunities like that.”Even so, he doesn’t expect AI to fully replace human workers at emergency dispatch centers.“None of these applications remove humans from the loop,” Chime said. “Man and machine, as far back as you can study tech, are better together than they are far apart.”Prepared says it works with more than 1,000 agencies that together serve about 100 million people in 49 states. Clients include the Las Vegas Metro Police Department, the Metro Nashville Department of Emergency Communications and El Paso 911.FacebookLinkedInTwitterPrintEmailTags:First RespondersJustice and Public SafetyGovTech BizArtificial IntelligenceThad RueterThad Rueter is a staff writer for Government Technology, a sister publication of Industry Insider — Florida. He covered local and state governments for newspapers in the Chicago area and Florida, as well as e-commerce, digital payments and related topics for various publications. He lives in Wisconsin.See More Stories by Thad Rueter"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://alleywatch.com/2025/05/global-startup-funding-top-largest-april-2025-vc/",
    "title": "The 13 Largest Global Startup Funding Rounds of April 2025",
    "content": "Armed with some data from our friends at CrunchBase, I broke down the largest global startup funding rounds for April 2025. I have included some additional information such as industry, round type, a brief description of the company, investors in the round, company location, and total equity funding raised for the company to further the analysis.13.SandboxAQ$150.0MRound:Series EDescription:Palo Alto-based SandboxAQ develops AI and quantum technology solutions that enhance biopharma, cybersecurity, and materials science. Founded by Jack Hidary in 2016,SandboxAQhas now raised a total of $950.0M in total equity funding and is backed by NVIDIA, Google, BNP Paribas, S32, and US Innovative Technology Fund.Investors in the round:Beyond Alpha Ventures, BNP Paribas, Google, Horizon Kinetics LLC, NVIDIA, Ray DalioIndustry:Artificial Intelligence (AI), Cyber Security, Information Technology, Quantum Computing, SaaSFounders:Jack HidaryFounding year:2016Location:Palo AltoTotal equity funding raised:$950.0M13.Thunes$150.0MRound:Series DDescription:Singapore-based Thunes provides a global payments infrastructure that enables businesses and financial to send and receive funds in various currencies. Founded by Eric Barbier and Peter Caluwe in 2016,Thuneshas now raised a total of $352.0M in total equity funding and is backed by Insight Partners, Bessemer Venture Partners, Checkout.com, Vitruvian Partners, and Endeavor Catalyst.Investors in the round:Apis Partners, Vitruvian PartnersIndustry:Financial Services, FinTech, Mobile Payments, PaymentsFounders:Eric Barbier, Peter CaluweFounding year:2016Location:SingaporeTotal equity funding raised:$352.0M12.Altruist$152.0MRound:Series FDescription:Culver City-based Altruist is a modern custodian that offers a digital investment platform for financial advisors to manage their clients’ investments. Founded by Jason Wenk in 2018,Altruisthas now raised a total of $601.5M in total equity funding and is backed by Insight Partners, ICONIQ Growth, Venrock, Salesforce Ventures, and Endeavor Catalyst.Investors in the round:Baillie Gifford, Carson Family Office, Geodesic Capital, GIC, ICONIQ Growth, Salesforce VenturesIndustry:Asset Management, Financial Services, FinTechFounders:Jason WenkFounding year:2018Location:Culver CityTotal equity funding raised:$601.5MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.11.Tailscale$160.0MRound:Series CDescription:Toronto-based Tailscale is a software company that provides zero-configuration virtual private networks (VPNs) for secure connectivity. Founded by Avery Pennarun, David Carney, and David Crawshaw in 2019,Tailscalehas now raised a total of $275.0M in total equity funding and is backed by Accel, Insight Partners, Uncork Capital, Inovia Capital, and Heavybit.Investors in the round:Accel, Anthony Casalena, CRV, Heavybit, Insight Partners, Uncork CapitalIndustry:Cyber Security, Information Technology, Infrastructure, Network SecurityFounders:Avery Pennarun, David Carney, David CrawshawFounding year:2019Location:TorontoTotal equity funding raised:$275.0M10.Electra$186.0MRound:Series BDescription:Boulder-based Electra produces clean iron using low-temperature electrochemistry powered by renewables to decarbonize and transform steel production. Founded by Sandeep Nijhawan in 2020,Electrahas now raised a total of $299.3M in total equity funding and is backed by National Science Foundation, Lowercarbon Capital, Temasek Holdings, Valor Equity Partners, and S2G Investments.Investors in the round:BHP Ventures, Breakthrough Energy Ventures, Builders Vision, Capricorn Investment Group, Collaborative Fund, Earth Venture Capital, Interfer, Lowercarbon Capital, Nucor Corporation, Rio Tinto, Roy Hill, S2G Investments, Temasek Holdings, Toyota Tsusho, Yamato KogyoIndustry:Energy, Industrial, Renewable EnergyFounders:Sandeep NijhawanFounding year:2020Location:BoulderTotal equity funding raised:$299.3M9.Apex$200.0MRound:Series CDescription:Los Angeles-based Apex designs and manufactures satellite buses tailored for various space missions. Founded by Ian Cinnamon and Maximilian Benassi in 2022,Apexhas now raised a total of $322.0M in total equity funding and is backed by StepStone Group, Andreessen Horowitz, Village Global, 8VC, and Lux Capital.Investors in the round:8VC, Andreessen Horowitz, Point72 Ventures, StepStone Group, Washington Harbour PartnersIndustry:Aerospace, Commercial, ManufacturingFounders:Ian Cinnamon, Maximilian BenassiFounding year:2022Location:Los AngelesTotal equity funding raised:$322.0MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.9.Base Power$200.0MRound:Series BDescription:Austin-based Base Power is a modern energy provider that specializes in residential backup battery systems and electricity plans. Founded by Zachary Dell in 2023,Base Powerhas now raised a total of $268.0M in total equity funding and is backed by Andreessen Horowitz, Valor Equity Partners, Lightspeed Venture Partners, Thrive Capital, and Altimeter Capital.Investors in the round:Addition, Altimeter Capital, Andreessen Horowitz, Jackson Moses, Lightspeed Venture Partners, Terrain, Thrive Capital, Trust Ventures, Valor Equity PartnersIndustry:Battery, Electrical Distribution, Energy, Energy Management, Energy Storage, Industrial, Power GridFounders:Zachary DellFounding year:2023Location:AustinTotal equity funding raised:$268.0M9.Persona$200.0MRound:Series DDescription:San Francisco-based Persona is an identity verification and management platform that enables businesses to automate and streamline their verification processes. Founded by Charles Yeh and Rick Song in 2018,Personahas now raised a total of $417.5M in total equity funding and is backed by Founders Fund, Coatue, Bond, First Round Capital, and Index Ventures.Investors in the round:Bond, Chemistry, Coatue, First Round Capital, Founders Fund, Index Ventures, Ribbit CapitalIndustry:Cyber Security, Fraud Detection, Identity Management, Information Technology, SaaSFounders:Charles Yeh, Rick SongFounding year:2018Location:San FranciscoTotal equity funding raised:$417.5M9.Supabase$200.0MRound:Series DDescription:San Francisco-based Supabase is an open-source Firebase alternative that provides a full PostgreSQL database. Founded by Anthony Wilson and Paul Copplestone in 2020,Supabasehas now raised a total of $396.1M in total equity funding and is backed by Y Combinator, Accel, Craft Ventures, Lightspeed Venture Partners, and Coatue.Investors in the round:Accel, Coatue, Craft Ventures, Felicis, Taylor Otwell, Y CombinatorIndustry:Artificial Intelligence (AI), Database, Developer Tools, Information Services, Information Technology, SoftwareFounders:Anthony Wilson, Paul CopplestoneFounding year:2020Location:San FranciscoTotal equity funding raised:$396.1MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.9.CMR Surgical$200.0MRound:VentureDescription:Cambridge-based CMR Surgical develops and manufactures robotic surgical systems to enhance precision and efficiency in minimally invasive surgery. Founded by Luke Hares, Mark Slack, and Martin Frost in 2014,CMR Surgicalhas now raised a total of $1.3B in total equity funding and is backed by Lightrock, Trinity Capital, Ally Bridge Group, SoftBank Vision Fund, and Cambridge Innovation Capital.Investors in the round:Trinity CapitalIndustry:Health Care, Medical, Medical Device, RoboticsFounders:Luke Hares, Mark Slack, Martin FrostFounding year:2014Location:CambridgeTotal equity funding raised:$1.3B8.Mainspring Energy$258.0MRound:Series FDescription:Menlo Park-based Mainspring Energy provides power generation technology using linear generators for clean energy. Founded by Adam Simpson, Matt Svrcek, and Shannon Miller in 2010,Mainspring Energyhas now raised a total of $726.0M in total equity funding and is backed by General Catalyst, Temasek Holdings, Khosla Ventures, Alumni Ventures, and Lightrock.Investors in the round:Climate Pledge Fund, DCVC, Gates Frontier Fund, General Catalyst, Khosla Ventures, LGT group, Lightrock, M&G Investments, Marunouchi Innovation Partners, Pictet Private Equity Investors S.A., Temasek HoldingsIndustry:Clean Energy, Energy, Oil and GasFounders:Adam Simpson, Matt Svrcek, Shannon MillerFounding year:2010Location:Menlo ParkTotal equity funding raised:$726.0M7.True Anomaly$260.0MRound:Series CDescription:Centennial-based True Anomaly is builds space security and resilience at the intersection of spacecraft, software, and autonomy. Founded by Even Rogers and Kyle Zakrzewski in 2022,True Anomalyhas now raised a total of $400.6M in total equity funding and is backed by Menlo Ventures, Accel, Rocketship.vc, Eclipse Ventures, and Riot Ventures.Investors in the round:645 Ventures, Accel, ACME Capital, Champion Hill Ventures, Eclipse Ventures, Menlo Ventures, Meritech Capital Partners, Narya Capital, Riot Ventures, Space.VCIndustry:Aerospace, Artificial Intelligence (AI), Manufacturing, Military, National SecurityFounders:Even Rogers, Kyle ZakrzewskiFounding year:2022Location:CentennialTotal equity funding raised:$400.6MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.6.Chaos$275.0MRound:Series CDescription:Los Angeles-based Chaos Industries develops advanced technologies for defense and critical industries. Founded by Bo Marr, Brett Cummings, Gavin Hood, and John Tenet in 2022,Chaoshas now raised a total of $490.0M in total equity funding and is backed by StepStone Group, Accel, Valor Equity Partners, 8VC, and New Enterprise Associates.Investors in the round:8VC, Accel, New Enterprise Associates, Overmatch Ventures, StepStone Group, Tru Arrow Partners, Valor Equity PartnersIndustry:Aerospace, Government, Military, National SecurityFounders:Bo Marr, Brett Cummings, Gavin Hood, John TenetFounding year:2022Location:Los AngelesTotal equity funding raised:$490.0M5.Runway$308.0MRound:Series DDescription:New York-based Runway is an applied AI research company that creates AI-powered content creation tools for the media and entertainment sectors. Founded by Alejandro Matamala Ortiz, Anastasis Germanidis, and Cristobal Valenzuela Barrera in 2018,Runwayhas now raised a total of $544.5M in total equity funding and is backed by General Atlantic, Madrona, NVIDIA, Google, and Lux Capital.Investors in the round:Baillie Gifford, Fidelity, General Atlantic, NVIDIA, SoftBankIndustry:Apps, Artificial Intelligence (AI), Generative AI, Machine Learning, Software, Video EditingFounders:Alejandro Matamala Ortiz, Anastasis Germanidis, Cristobal Valenzuela BarreraFounding year:2018Location:New YorkTotal equity funding raised:$544.5M4.DennoKotsu¥2.5BRound:Series DDescription:Tokushima-based Denno Kotsu specializes in taxi dispatch systems and contract dispatch services for taxi companies. Founded by Bando Yuki and Okada Ikuhiro in 2015,DennoKotsuhas now raised a total of $348.3M in total equity funding and is backed by Uber, Japan Post Investment, NTT DOCOMO Ventures, Mitsubishi Corporation, and Iyogin Capital.Investors in the round:Awagin Capital, DAIICHI KOUTSU SANGYO, Daiwa Motor Transportation, Iyogin Capital, Japan Post Investment, Kokusai Motorcars, Mitsubishi Corporation, MK, Sanwa Transportation, Tokushima Taisho Bank, Tsubame Motors, UberIndustry:Automotive, Software, Task Management, Taxi Service, TransportationFounders:Bando Yuki, Okada IkuhiroFounding year:2015Location:TokushimaTotal equity funding raised:$348.3MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.3.Chainguard$356.0MRound:Series DDescription:Kirkland-based Chainguard is a cloud-native development platform that provides low-to-zero CVE container images for building and running applications. Founded by Dan Lorenc, Kim Lewandowski, and Ville Aikas in 2021,Chainguardhas now raised a total of $612.0M in total equity funding and is backed by Sequoia Capital, Lightspeed Venture Partners, IVP, Spark Capital, and Salesforce Ventures.Investors in the round:Amplify Partners, Datadog Ventures, IVP, Kleiner Perkins, Lightspeed Venture Partners, MANTIS Venture Capital, Redpoint, Salesforce Ventures, Sequoia Capital, Spark Capital, Windproof Partners (fka Kerrest & Co.)Industry:Cloud Security, Developer Tools, Enterprise Software, Open Source, SecurityFounders:Dan Lorenc, Kim Lewandowski, Ville AikasFounding year:2021Location:KirklandTotal equity funding raised:$612.0M2.Plaid$575.0MRound:VentureDescription:San Francisco-based Plaid develops financial technology infrastructure that enables applications to connect with users’ bank accounts and financial data. Founded by William Hockey and Zachary Perret in 2013,Plaidhas now raised a total of $1.3B in total equity funding and is backed by Franklin Templeton, Norwest Venture Partners, Andreessen Horowitz, BoxGroup, and BlackRock.Investors in the round:BlackRock, Fidelity, Franklin Templeton, New Enterprise Associates, Ribbit CapitalIndustry:Banking, Financial Services, FinTech, InsurTech, Wealth ManagementFounders:William Hockey, Zachary PerretFounding year:2013Location:San FranciscoTotal equity funding raised:$1.3B1.Safe Superintelligence$2.0BRound:VentureDescription:Palo Alto-based Safe Superintelligence develops AI solutions prioritizing safety in artificial intelligence. Founded by Daniel Gross, Daniel Levy, and Ilya Sutskever in 2024,Safe Superintelligencehas now raised a total of $3.0B in total equity funding and is backed by Andreessen Horowitz, NVIDIA, Sequoia Capital, Lightspeed Venture Partners, and Alphabet.Investors in the round:Alphabet, Andreessen Horowitz, DST Global, Greenoaks, Lightspeed Venture Partners, NVIDIAIndustry:Artificial Intelligence (AI), Information Technology, Internet, Software EngineeringFounders:Daniel Gross, Daniel Levy, Ilya SutskeverFounding year:2024Location:Palo AltoTotal equity funding raised:$3.0BTags:645 Ventures8VCAccelACME capitalAdam SimpsonAdditionAlejandro Matamala OrtizAlphabetAltimeter CapitalAltruistAmplify PartnersAnastasis GermanidisAndreessen HorowitzAnthony CasalenaAnthony WilsonApexApis PartnersAvery PennarunAwagin CapitalBaillie GiffordBando YukiBase PowerBeyond Alpha VenturesBHP VenturesBlackRockBNP ParibasBo MarrBONDBreakthrough Energy VenturesBrett CummingsBuilders VisionCapricorn Investment GroupCarson Family OfficeChainguardChampion Hill VenturesChaosCharles YehChemistryClimate Pledge FundCMR SurgicalCoatueCollaborative FundCraft VenturesCristobal Valenzuela BarreraCRVDAIICHI KOUTSU SANGYODaiwa Motor TransportationDan LorencDaniel GrossDaniel LevyDatadog VenturesDavid CarneyDavid CrawshawDCVCDennoKotsuDST GlobalEarth Venture CapitalEclipse VenturesElectraEric BarbierEven RogersFelicisFidelityFirst Round CapitalFounders FundFranklin TempletonGates Frontier fundGavin HoodGeneral CatalystGeodesic CapitalGICGoogleGreenoaksHeavybitHorizon Kinetics LLCIan CinnamonICONIQ GrowthIlya SutskeverIndex VenturesInsight PartnersInterferIVPIyogin CapitalJack HidaryJackson MosesJapan Post InvestmentJason WenkJohn TenetKhosla VenturesKim LewandowskiKleiner PerkinsKokusai MotorcarsKyle ZakrzewskiLGT groupLightrockLightspeed Venture PartnersLowercarbon CapitalLuke HaresM&G InvestmentsMainspring EnergyMANTIS Venture CapitalMark SlackMartin FrostMarunouchi Innovation PartnersMatt SvrcekMaximilian BenassiMenlo VenturesMeritech Capital PartnersMitsubishi CorporationMKNarya CapitalNew Enterprise AssociatesNucor CorporationNvidiaOkada IkuhiroOvermatch VenturesPaul CopplestonePersonaPeter CaluwePictet Private Equity Investors S.A.PlaidPoint72 VenturesRay DalioRedpointRibbit CapitalRick SongRio TintoRiot VenturesRoy HillRunwayS2G InvestmentsSafe SuperintelligenceSalesforce VenturesSandboxAQSandeep NijhawanSanwa TransportationSequoia CapitalShannon MillerSoftBankSpace.VCSpark CapitalStepStone GroupSupabaseTailscaleTaylor OtwellTemasek HoldingsTerrainThrive CapitalThunesTokushima Taisho BankToyota TsushoTrinity CapitalTru Arrow PartnersTrue AnomalyTrust VenturesTsubame MotorsUberUncork CapitalValor Equity PartnersVille AikasVitruvian PartnersWashington Harbour PartnersWilliam HockeyWindproof PartnersY CombinatorYamato KogyoZachary DellZachary Perret"
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://www.startuphub.ai/clickhouse-secures-350m-series-c-funding-for-high-speed-database/",
    "title": "Request Error",
    "content": "Failed to scrape https://www.startuphub.ai/clickhouse-secures-350m-series-c-funding-for-high-speed-database/ after 3 attempts due to request error: ('Connection aborted.', RemoteDisconnected('Remote end closed connection without response'))."
  },
  {
    "alert_name": "Google Alert - Funding Series C",
    "date": "2025-05-30",
    "url": "https://financialit.net/news/fundraising-news/stitch-secures-10-million-funding-simplify-banking-and-payments-innovation",
    "title": "Stitch Secures $10 Million in Funding to Simplify Banking and Payments Innovation | Financial IT",
    "content": "BREAKING NEWSWorldpay and Exodus Team Up: Pioneering Native Card Payments for Self-Custodial Crypto WalletsMiniPay Launches iOS Wallet App to Bring Stablecoin to Millions More ConsumersdLocal and PayPal Expand Access to Local Payments Across Emerging MarketsGFT Expands AI Compliance to Protect the $236.6B Canadians Entrust in Credit UnionsHSBC Launches TradePay for Import Duties Solution for US ClientsRevolut Selects Fourthline as Identity PartnermyTU Unlocks New Payment Infrastructure with Visa and Mastercard Acquiring Licensespayabl. Leverages Sift’s AI-Powered Fraud Platform to Protect Businesses from FraudPliant Closes $40 Million Series B Funding to Expand Into the U.S. MarketStitch Secures $10 Million in Funding to Simplify Banking and Payments InnovationFundraising News30.05.202507:55 amStitch, the unified platform for launching and scaling financial products, today announced the successful closing of a $10 million seed round. The Saudi Arabia headquartered company attracted investments from leading investors including Arbor Ventures, COTU Ventures, Raed Ventures, and SVC. The round has also had participation from various family offices and industry veterans including Marqeta's founder Jason Gardner, and Abdulmalik AlSheikh who previously led the establishment of critical payment networks such as mada and Sadad in the KSA. The funding will accelerate Stitch’s growth to transform financial infrastructure in the region.The demand for integrated, technology infrastructure for financial and non-financial institutions is accelerating both globally and across the Middle East. The global Banking & Financial Services Industry (BFSI) is projected to reach USD 221.39 billion by 2033, up from USD 91.42 billion in 2024, with a compound annual growth rate (CAGR) of 10.3% during the forecast period. This surge is driven by the increasing demand for digital transformation across banking, financial services, and insurance sectors. In Saudi Arabia alone, banking sector assets have surged to US $ 1.12 trillion (SAR 4.22 trillion), while digital payments grew by 75% between 2019 and 2021, and point-of-sale transactions reached US$ 177.69 billion (SAR 667 billion) in FY 2024.Businesses in the Middle East, from banks and lenders to consumer brands and large enterprises still face significant barriers to building modern financial products. Stitch is addressing this gap with a unified infrastructure platform built in the Middle East and designed to compete globally. Launched initially for clients in Saudi Arabia and the UAE, Stitch is already attracting interest beyond the region, and has secured clients in the Eastern African region, starting with Kenya.\"At Stitch, our vision is to reinvent how financial and non-financial institutions bring banking and payment products to market.\" said Mohamed Oueida, Founder & CEO of Stitch.\"Today, the process of building financial products is broken. Businesses are forced to navigate outdated legacy systems and complex regulatory frameworks, making things slow, expensive, and mostly painful. It doesn't have to be this way. Stitch exists to change this. Institutions should be able to focus on what matters and have a platform that can mold around their creativity. We are generally looking to make this process a lot more enjoyable for our partners.\"The first-of-its-kind business in the Middle East, Stitch’s technology offers the simplest way for enterprises to build financial products, delivering an API-driven solution that eliminates the inefficiencies and complexities of legacy systems. Designed to meet the evolving needs of modern financial services, Stitch serves as the unified platform to launch and scale banking and payment products up to 80% faster.The $10 million raised will be used to expand Stitch’s team and enhance its platform capabilities, further establishing the company as a trusted infrastructure partner for banks, fintech firms, and non-financial enterprises integrating financial services. Major clients such as Lulu Exchange, Alamoudi Exchange, Foodics, Dar Al Tamleek, and Tanmeya Capital—are already leveraging Stitch’s technology to launch tailored financial solutions across diverse sectors and regions.Nora Alsarhan, Deputy CEO and Chief Investment Officer at SVC, commented, “Our investment in Stitch is driven by our commitment to supporting the growth of innovative Saudi-based startups, enabling them to compete both regionally and globally. We believe Stitch has the potential to play a significant role in developing a more capable and resilient financial ecosystem in the Middle East and around the world.”Khaled Lababidi, Partner, Arbor Ventures commented, “As emerging markets digitalise their financial services, we believe the next generation of technology infrastructure will come from places like Saudi Arabia and led by founders who understand these regions. Stitch is a clear example of this shift, combining local expertise with global standards to support institutions across emerging markets. Their platform addresses long-standing infrastructure gaps by offering a simplified but compliant solution that’s built for scale, speed and security.”Wael Nafee, General Partner, Raed Ventures, commented: “For the first time, financial institutions in the region have a local infrastructure partner that was built from the ground up with their realities in mind, with the ability to compete anywhere in the world. Stitch isn’t just creating an alternative to legacy systems; they’re setting a new standard for how financial products should be built. Their focus on technical depth with global ambitions has set them apart from day one. This is not just the kind of company we want to back, but is also indicative of the impact that Middle East startups can have on the global tech ecosystem.”Founded in 2022, Stitch has attracted industry-leading talent from global organisations including FIS, Geidea, Rain Financial, NPCI India, Al Rajhi Bank and many others, with a commitment to driving long-term innovation in the banking and payments industry.Related NewsMonarch Secures $75 Million in Series B Funding to...30.05.202501:15 pmKashable Secures $250 Million Credit Facility to...29.05.202504:10 pmHusk Secures €1M to Revolutionize Startup Finance29.05.202502:05 pmAuditstage Raises €750.000 from Smartfin to...29.05.202501:45 pmRillet Raises $25M Series A From Sequoia Capital to...29.05.202508:45 amOutmin Raises €4M to Scale AI Bookkeeping, Names Ex-...28.05.202503:25 pmRevenueCat Raises $50M Series C to Expand Global...23.05.202504:15 pmOpenFX Raises $23M in Initial Funding to Revolutionize...23.05.202507:25 amKeep Raises C$108M to Transform Small Business Banking...22.05.202502:15 pmGreenlite AI Raises $15M Series A to Help Banks and...22.05.202502:05 pmAcrisure Secures $2.1 Billion Funding Round Led by...21.05.202505:15 pmAirwallex Raises $300 Million at a $6.2 Billion...21.05.202511:05 amLatest IssueFree Newsletter SubscriptionLeave this field blankFinTech ListPayment gatewaysChallenger banksChallenger banksChallenger banksChallenger banksPopular TagsBankingDataConsultancyTransaction BankingRegTechSecurity/ComplianceCloudTrading SystemsBlockchainFinTech StartUpsM&A DealsInfrastructureArtificial Intelligence"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://yourstory.com/2025/05/funding-indias-next-ai-native-builders-nykaa-nearly-triples-profit",
    "title": "Funding India’s next AI-native builders; Nykaa nearly triples its profit",
    "content": "ADVERTISEMENTAdvertise with usDaily CapsuleFunding India’s next AI-native builders; Nykaa nearly triples its profitBoldCap is reimagining its investment strategy to back early-stage AI-native startups in India. FSN Ecommerce Ventures posted a 2.9X growth in after-tax profit. Togglenow offers SAP security and GRC consulting, implementation, and automation solutions.Team YS15582 StoriesSaturday May 31, 2025,5 min ReadFOLLOW USHello,Recovery is on the horizon for India.India’s economy grew at a faster pace than analysts expected last quarter, driven by a rebound in investments and strong services sector activity.Gross domestic product clocked in at afour-quarter highof 7.4% in the quarter ended March 2025, according to the Statistics Ministry, higher than the average of 6.8% predicted by economists surveyed byBloomberg. The government pegged the full-year GDP growth at 6.5%.A strong economy comes with a strong hand on trade. India will reportedly urge the US toscrapthe 10% baseline tariff imposed by US President Donald Trump, especially in the wake of legal challenges to his trade policy.US supremacy is being challenged in a number of areas, especially in AI development. According to star investor Mary Meeker, US AI pioneers such as OpenAI might soon be at risk of beingundercutby cheaper rivals like China’s DeepSeek.From multi-billion dollar tech deals to new agentic tools, the AI space has been through some sea changes this month.YourStoryhassummed upall that happened.Innovation can spring from the most innocuous places, and go on to create history. This Saturday, join us asYourStoryand The Bharat Project host the brightest entrepreneurs building for Bharat across healthtech, agritech, deeptech, climate, and more.Don’t forget to catch all the actionhere.In today’s newsletter, we will talk aboutFunding India’s next AI-native buildersNykaa nearly triples its profitGRC consulting for mid-sized firmsHere’s your trivia for today: Which famous inventor averaged one invention patent for every two weeks of his working life?InvestorFunding India’s next AI-native buildersAs AI becomes the next universal interface, early-stage investor ﻿BoldCap﻿believes the traditional venture capital playbook needs a fundamental shift to support ‘new breed of builders’.In its newly-released AI Manifesto, the Bengaluru-based VC firm outlines a strategy that goes beyond vanilla venture capital. The investment firm is pairing capital with deep technical guidance and building founder-first networks to back these firms.Misunderstood market:Siddharth Ram, VP - Marketing and Platform at BoldCap believes that by being solely AI-native, the firm gains a distinct edge—one that generalist investors simply can’t replicate.  “The goal is to become a default choice for AI-native founders.”The problem, Ram believes, is that most investors are still approaching AI companies with outdated models. “Most funds still don't get it. They're asking about moats the same way they would for traditional SaaS, but the entire premise is different.”Unlike other firms, the AI-focused VC does not follow a spray-and-pray model. It instead focuses on structured investments combined with hands-on support and platform access, helping startups progress to subsequent funding rounds.Top Funding Deals of the WeekStartup: CitykartAmount: Rs 538 CrRound: Series BStartup: Saarathi FinanceAmount: Rs 475 CrRound: Series AStartup: SnitchAmount: Rs 279 CrRound: Series BBeautyNykaa nearly triples its profitFSN Ecommerce Ventures, the parent company of beauty ecommerce platform Nykaa, nearly tripled its after-tax profit, buoyed by the robust performance of its core beauty and personal care businesses.During the March quarter, the startup earned Rs 20.28 crore net profit, compared with Rs 6.93 crore it posted in the corresponding quarter of the previous year as the margins of its core business improved.Key takeaways:The Falguni Nayar-led company also saw its expenses rise by 22.7% YoY to Rs 2,031 crore in the fourth quarter, mostly hurt by employee benefit expenses, finance costs and depreciation expenses.Its core beauty and personal care vertical delivered a 24% YoY growth in topline to Rs 1,894 crore. However, on a quarter-over-quarter basis, this segment saw a decline in income from Rs 2,060 crore earned in Q3.Nykaa’s fashion vertical, which competes with Myntra, Tata Cliq Fashion and Ajio, saw a further decline in its bottom line, with a loss of Rs 36.4 crore. However, the segment's revenue rose by 10% to Rs 161 crore.StartupGRC consulting for mid-sized firmsSAP is widely considered one of the leading enterprise resource planning systems, however, it has long posed significant challenges around access governance, cybersecurity, and compliance automation, especially for mid-sized organisations with limited resources.ToggleNow is taking on established players in this space, building tools and services tailored to streamline GRC and security within SAP environments.Bharat ke InnovatorsHow Respirer is reshaping air quality standardsRespirer delivers real-time, hyperlocal air quality data to communities, industries, and policymakers. It has emerged as a pioneer in climate tech, developing low-power IoT devices and analytics platforms tailored for Indian cities.Building a greener future from trashSaltech Design Labs is shaped by the founders’ firsthand exposure to the health and environmental perils of unmanaged waste. They’ve developed a closed-loop, zero-cement process to transform low-value waste into construction materials.News & updatesCapital outflow:Global equity funds posted outflows for a second straight week through May 28, as risk aversion rose following US President Donald Trump’s tariff threats on EU imports and overseas-made iPhones, alongside a spike in long-tenor bond yields.Everyday AI:Google’s AI assistant, Gemini, is gaining a more prominent place in inboxes with the launch of email summary cards, which will appear at the top of emails. The company announced that users would no longer have to tap an option to summarise an email with AI.AI revenue:Dell reported fiscal first-quarter revenue that topped analysts’ expectations, driven by growth in AI server sales. The Nvidia partner's quarterly revenue grew 5% year-over-year to $23.38 billion. Servers and networking revenue jumped 16% to a record $6.3 billion.Which famous inventor averaged one invention patent for every two weeks of his working life?Answer: Thomas Edison.We would love to hear from you! To let us know what you liked and disliked about our newsletter, please mail[email protected].If you don’t already get this newsletter in your inbox,sign up here. For past editions of the YourStory Buzz, you can check ourDaily Capsule page here.ADVERTISEMENTAdvertise with usADVERTISEMENTAdvertise with usMOST VIEWED STORIES1BooksJune reading list: 5 Books to reignite your mid-year drive2Books5 Short books with lessons perfect for your weekend reads3In-focusHow Retrod is empowering small hotels across India4BooksBest insomnia reads: 7 books that are worth staying up for5NewsInfibeam Avenues net profit soars 2.7X YoY to Rs 70 Cr in Q1 FY25ADVERTISEMENTAdvertise with usADVERTISEMENTAdvertise with us"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://www.finsmes.com/2025/05/volteras-raises-11-1m-in-series-a-funding.html",
    "title": "Volteras Raises $11.1M in Series A Funding",
    "content": "HomeUKVolteras Raises $11.1M in Series A FundingUKVolteras Raises $11.1M in Series A FundingByFinSMEs-May 30, 2025FacebookTwitterWhatsAppLinkedinVolteras, a London, UK-based data streaming platform for the energy ecosystem, raised $11.1M in Series A funding.The round was led by Union Square Ventures, with participation from fleet card providers Wex and Edenred, alongside existing investors, Exor ventures and Long Journey Ventures.The company intends to use the funds to:expand its partnerships with automakers and energy device manufacturers globally;grow its team of software engineers, data scientists, and energy product specialists; andsupport new partners like Octopus Electric Vehicles and Hitachi ZeroCarbon in launching new EV services.Led by CEO Peter Wilson, Volteras is a provider of a data streaming platform for the energy ecosystem, connecting vehicles, chargers, and energy systems securely and efficiently. Through OEM-authorized data integrations, it gives energy and mobility businesses access to accurate device data second by second.FinSMEs30/05/2025TagsEdenredExor VenturesLong Journey VenturesUnion Square VenturesVolterasWexFacebookTwitterWhatsAppLinkedinPrevious articleCurifyLabs Raises €6.7M in FundingNext articleSnorkel AI Raises $100M in Series D Funding at a $1.3 Billion ValuationRELATED ARTICLESUKRoxFit Raises £800K in FundingUKVelocity Raises $10M in Pre-Seed FundingUKApplied Computing Raises £9M in Seed FundingTHE DAILY NEWSLETTER - SIGNUPEmail address:Leave this field empty if you're human:"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://in.fashionnetwork.com/news/Slikk-raises-10-million-in-series-a-funding-round-led-by-nexus-venture-partners,1735354.html",
    "title": "Slikk raises $10 million in series A funding round led by Nexus Venture Partners",
    "content": "ByMaverick MartinsPublished May 30, 2025DownloadPrintText sizeaA+aA-Slikk raises $10 million in series A funding round led by Nexus Venture PartnersByMaverick MartinsPublishedMay 30, 2025Fashion delivery platform Slikk has raised $10 million (Rs 85 crore) in an all-equity series A round led by Nexus Venture Partners, with participation from existing investor Lightspeed. Earlier, it had raised $3.2 million in a seed round from Lightspeed.Slikk raises $10 million in series A funding round led by Nexus Venture Partners - SlikkThe company will utilise the funds to fuel its next phase of growth that includes launch of new lifestyle categories, rollout of instant returns, and expansion into more urban pin codes.Commenting on the funding, Akshay Gulati, co-founder & CEO at Slikk in a statement said, “Slikk, since inception, has delivered a high-quality customer experience through our 60-minute delivery model. Brands have been able to unlock new users at a hyperlocal level. With this new round, we intend to double down on that promise and offer a significantly wider range of products and experiences to our customers.”Pratik Poddar, Partner at Nexus Venture Partners added, “Having watched quick commerce reshape India's consumer behaviour, we firmly believe fashion is the definitive next frontier for digital disruption. The Slikk team's deep category insights and strategic execution are precisely what this moment demands. We're incredibly excited to be long-term partners in shaping this future.”Founded by Akshay Gulati, Om Prakash Swami, and Bipin Singh, Slikk delivers clothing and accessories within 60 minutes in select areas of Bengaluru.Copyright © 2025 FashionNetwork.com All rights reserved.Tags :FashionReady-to-wearBusiness"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/",
    "title": "HTTP 403",
    "content": "Failed to access https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/: 403 Client Error: Forbidden for url: https://news.crunchbase.com/venture/biggest-funding-rounds-billion-dollar-ai-biotech-grammarly-neuralink/"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://thepaypers.com/cryptocurrencies/conduit-secures-usd-36-million-in-series-a-funding-to-expand-stablecoin-use--1273868",
    "title": "Conduit secures USD 36 million in Series A funding to expand stablecoin use",
    "content": "Conduit, a cross-border payments platform, has announced today that it has completed a USD 36 million Series A funding round.The funding round was co-led by Dragonfly and Altos Ventures, with contributions from Sound Ventures, Commerce Ventures, DCG, and Circle Ventures, the issuer of the USDC stablecoin. Existing investors Helios Digital Ventures and Portage Ventures also participated.Funding to support global expansion and currency integrationConduit operates a cross-border payment network that integrates stablecoins, USD, and local currencies, providing businesses with a cost-effective alternative to the traditional SWIFT system. The company is connected to numerous local banks across North America, Latin America, Europe, Africa, and Asia. It plans to use the capital to expand into new markets and support a variety of traditional and digital currencies within its payment systems.This funding round follows an important growth period for Conduit, with transaction volumes on its platform increasing sixteenfold from 2023 to 2024, according to company data. The platform combines crypto-native infrastructure with traditional finance, enabling programmable global transactions that incorporate integrated anti-money laundering (AML), sanctions screening, and transaction monitoring.The benefits of using Conduit include:Speed: Conduit has direct partnerships with banks worldwide, therefore, transactions are completed more quickly;Geographic coverage: the company supports a wide range of currencies and payment methods, including local currencies that experience high inflation in regions such as Latin America, Africa, and Asia;Strong liquidity: Conduit’s network of institutional-grade foreign exchange providers ensures that large transactions can be conducted without any liquidity constraints.Conduit's platform facilitates global transfers across diverse payment systems, including USD networks (SWIFT, ACH, FedWire) and local systems in Europe, the UK, China, and Nigeria. It addresses challenges like limited USD access, low SWIFT connectivity, and high fees. While stablecoins increase treasury management, Conduit simplifies the transition between stablecoins and local currencies in real time for efficient invoice settlement."
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://www.finsmes.com/2025/05/uplinq-raises-10m-in-series-a-funding.html",
    "title": "Uplinq Raises $10M in Series A Funding",
    "content": "HomeUSAUplinq Raises $10M in Series A FundingUSAUplinq Raises $10M in Series A FundingByFinSMEs-May 30, 2025FacebookTwitterWhatsAppLinkedinUplinq, Phoenix, AZ-based provider of AI-driven bookkeeping and tax solutions for small and medium-sized businesses (SMBs), raised $10M in Series A funding.The round was led by Next Coast Ventures, with participation from AZ-VC, Live Oak Ventures, and existing investors.The company intends to use the funds to accelerate its growth, enhance its AI capabilities, scale customer acquisition efforts, and strengthen infrastructure to deliver automated financial management.Founded in 2020, and led by CEO Alex Glenn, Uplinq provides SMBs with an AI-powered platform to automate bookkeeping and tax processes and focus on growth and innovation.The solution employs intelligent AI Agents to manage every aspect of bookkeeping—from transaction categorization and reconciliation to predictive insights and tax compliance—streamlining workflows and reducing manual intervention. This automation enhances accuracy and operational efficiency and allows SMBs to leverage financial insights in real-time, driving strategic decision-making and business growth.The system integrates with existing financial systems, providing real-time insights and ensuring compliance.Uplinq is already serving nearly 1,000 small and mid-sized businesses across the U.S.FinSMEs30/05/2025TagsAZ-VCLive Oak VenturesNext Coast VenturesUplinqFacebookTwitterWhatsAppLinkedinPrevious articleEquitiesFirst and Alternative Financing’s Role in Robotics InvestmentNext articleZircuit Enables Non-Custodial Wallet Top-Ups for Crypto.com Visa CardsRELATED ARTICLESUSAR1 Receives Investment from Khosla VenturesUSAVima Therapeutics Raises $60M in Series A FundingUSAUnbound Raises $4M in FundingTHE DAILY NEWSLETTER - SIGNUPEmail address:Leave this field empty if you're human:"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "http://www.fnbnews.com/Top-News/growit-raises-3-mn-in-series-a-round-led-by-gvfl-82864",
    "title": "FNB News - GROWiT raises $3 mn in Series A round led by GVFL | FNB News",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://financialit.net/news/fundraising-news/stitch-secures-10-million-funding-simplify-banking-and-payments-innovation",
    "title": "Stitch Secures $10 Million in Funding to Simplify Banking and Payments Innovation | Financial IT",
    "content": "BREAKING NEWSWorldpay and Exodus Team Up: Pioneering Native Card Payments for Self-Custodial Crypto WalletsMiniPay Launches iOS Wallet App to Bring Stablecoin to Millions More ConsumersdLocal and PayPal Expand Access to Local Payments Across Emerging MarketsGFT Expands AI Compliance to Protect the $236.6B Canadians Entrust in Credit UnionsHSBC Launches TradePay for Import Duties Solution for US ClientsRevolut Selects Fourthline as Identity PartnermyTU Unlocks New Payment Infrastructure with Visa and Mastercard Acquiring Licensespayabl. Leverages Sift’s AI-Powered Fraud Platform to Protect Businesses from FraudPliant Closes $40 Million Series B Funding to Expand Into the U.S. MarketStitch Secures $10 Million in Funding to Simplify Banking and Payments InnovationFundraising News30.05.202507:55 amStitch, the unified platform for launching and scaling financial products, today announced the successful closing of a $10 million seed round. The Saudi Arabia headquartered company attracted investments from leading investors including Arbor Ventures, COTU Ventures, Raed Ventures, and SVC. The round has also had participation from various family offices and industry veterans including Marqeta's founder Jason Gardner, and Abdulmalik AlSheikh who previously led the establishment of critical payment networks such as mada and Sadad in the KSA. The funding will accelerate Stitch’s growth to transform financial infrastructure in the region.The demand for integrated, technology infrastructure for financial and non-financial institutions is accelerating both globally and across the Middle East. The global Banking & Financial Services Industry (BFSI) is projected to reach USD 221.39 billion by 2033, up from USD 91.42 billion in 2024, with a compound annual growth rate (CAGR) of 10.3% during the forecast period. This surge is driven by the increasing demand for digital transformation across banking, financial services, and insurance sectors. In Saudi Arabia alone, banking sector assets have surged to US $ 1.12 trillion (SAR 4.22 trillion), while digital payments grew by 75% between 2019 and 2021, and point-of-sale transactions reached US$ 177.69 billion (SAR 667 billion) in FY 2024.Businesses in the Middle East, from banks and lenders to consumer brands and large enterprises still face significant barriers to building modern financial products. Stitch is addressing this gap with a unified infrastructure platform built in the Middle East and designed to compete globally. Launched initially for clients in Saudi Arabia and the UAE, Stitch is already attracting interest beyond the region, and has secured clients in the Eastern African region, starting with Kenya.\"At Stitch, our vision is to reinvent how financial and non-financial institutions bring banking and payment products to market.\" said Mohamed Oueida, Founder & CEO of Stitch.\"Today, the process of building financial products is broken. Businesses are forced to navigate outdated legacy systems and complex regulatory frameworks, making things slow, expensive, and mostly painful. It doesn't have to be this way. Stitch exists to change this. Institutions should be able to focus on what matters and have a platform that can mold around their creativity. We are generally looking to make this process a lot more enjoyable for our partners.\"The first-of-its-kind business in the Middle East, Stitch’s technology offers the simplest way for enterprises to build financial products, delivering an API-driven solution that eliminates the inefficiencies and complexities of legacy systems. Designed to meet the evolving needs of modern financial services, Stitch serves as the unified platform to launch and scale banking and payment products up to 80% faster.The $10 million raised will be used to expand Stitch’s team and enhance its platform capabilities, further establishing the company as a trusted infrastructure partner for banks, fintech firms, and non-financial enterprises integrating financial services. Major clients such as Lulu Exchange, Alamoudi Exchange, Foodics, Dar Al Tamleek, and Tanmeya Capital—are already leveraging Stitch’s technology to launch tailored financial solutions across diverse sectors and regions.Nora Alsarhan, Deputy CEO and Chief Investment Officer at SVC, commented, “Our investment in Stitch is driven by our commitment to supporting the growth of innovative Saudi-based startups, enabling them to compete both regionally and globally. We believe Stitch has the potential to play a significant role in developing a more capable and resilient financial ecosystem in the Middle East and around the world.”Khaled Lababidi, Partner, Arbor Ventures commented, “As emerging markets digitalise their financial services, we believe the next generation of technology infrastructure will come from places like Saudi Arabia and led by founders who understand these regions. Stitch is a clear example of this shift, combining local expertise with global standards to support institutions across emerging markets. Their platform addresses long-standing infrastructure gaps by offering a simplified but compliant solution that’s built for scale, speed and security.”Wael Nafee, General Partner, Raed Ventures, commented: “For the first time, financial institutions in the region have a local infrastructure partner that was built from the ground up with their realities in mind, with the ability to compete anywhere in the world. Stitch isn’t just creating an alternative to legacy systems; they’re setting a new standard for how financial products should be built. Their focus on technical depth with global ambitions has set them apart from day one. This is not just the kind of company we want to back, but is also indicative of the impact that Middle East startups can have on the global tech ecosystem.”Founded in 2022, Stitch has attracted industry-leading talent from global organisations including FIS, Geidea, Rain Financial, NPCI India, Al Rajhi Bank and many others, with a commitment to driving long-term innovation in the banking and payments industry.Related NewsMonarch Secures $75 Million in Series B Funding to...30.05.202501:15 pmKashable Secures $250 Million Credit Facility to...29.05.202504:10 pmHusk Secures €1M to Revolutionize Startup Finance29.05.202502:05 pmAuditstage Raises €750.000 from Smartfin to...29.05.202501:45 pmRillet Raises $25M Series A From Sequoia Capital to...29.05.202508:45 amOutmin Raises €4M to Scale AI Bookkeeping, Names Ex-...28.05.202503:25 pmRevenueCat Raises $50M Series C to Expand Global...23.05.202504:15 pmOpenFX Raises $23M in Initial Funding to Revolutionize...23.05.202507:25 amKeep Raises C$108M to Transform Small Business Banking...22.05.202502:15 pmGreenlite AI Raises $15M Series A to Help Banks and...22.05.202502:05 pmAcrisure Secures $2.1 Billion Funding Round Led by...21.05.202505:15 pmAirwallex Raises $300 Million at a $6.2 Billion...21.05.202511:05 amLatest IssueFree Newsletter SubscriptionLeave this field blankFinTech ListPayment gatewaysChallenger banksChallenger banksChallenger banksChallenger banksPopular TagsBankingDataConsultancyTransaction BankingRegTechSecurity/ComplianceCloudTrading SystemsBlockchainFinTech StartUpsM&A DealsInfrastructureArtificial Intelligence"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://arcticstartup.com/inven-raises-12-75m-series-a/",
    "title": "HTTP 403",
    "content": "Failed to access https://arcticstartup.com/inven-raises-12-75m-series-a/: 403 Client Error: Forbidden for url: https://arcticstartup.com/inven-raises-12-75m-series-a/"
  },
  {
    "alert_name": "Google Alert - Funding Series A",
    "date": "2025-05-30",
    "url": "https://www.internationalaccountingbulletin.com/news/bookkeeping-startup-uplinq-raises-10m/",
    "title": "AI-powered Uplinq raises $10m",
    "content": "NewsAI-powered Uplinq raises $10mHeadquartered in Tempe, Arizona, the US, Uplinq intends to deploy the capital to fuel its expansion and advance its AI technology.May 30, 2025ShareCopy LinkShare on XShare on LinkedinShare on FacebookThe platform employs AI agents to manage all the aspects of bookkeeping. Credit: tonton/Shutterstock.Uplinq, an AI-powered bookkeeping and tax solutions provider focused on small and medium-sized businesses (SMBs), has secured $10m in its Series A funding round.Next Coast Ventures led the funding round, which also saw participation from AZ-VC, Live Oak Ventures, and existing investors.Headquartered in Tempe, Arizona, the US, Uplinq intends to deploy the capital to fuel its expansion, advance its AI technology, broaden customer acquisition initiatives, and bolster its infrastructure to provide efficient, automated financial management solutions.As Uplinq embarks on its next growth stage, it is actively scaling its engineering, go-to-market, and customer success teams.SMBs continue to face difficulties in managing financial operations, frequently slowed down by outdated bookkeeping practices and legacy tax systems that are inefficient and prone to mistakes, the startup explained.Uplinq adds that it tackles these issues by utilising AI to streamline intricate bookkeeping and tax processes, delivering accuracy, efficiency, and scalability.GlobalData Strategic IntelligenceUS Tariffs are shifting - will you react or anticipate?Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis.By GlobalDataLearn more about Strategic IntelligenceThe platform employs AI agents to manage all the aspects of bookkeeping, from transaction classification and reconciliation to predictive insights and tax compliance.Uplinq said: “This cutting-edge automation not only enhances accuracy and operational efficiency but also empowers SMBs to leverage financial insights in real-time, driving strategic decision-making and business growth.”Next Coast Ventures co-founder and managing partner Thomas Ball said: “Uplinq is transforming the way SMBs approach financial management. Their innovative use of AI to automate bookkeeping and tax processes addresses a critical need in the market. We are excited to support their journey as they scale and redefine industry standards.”Established in 2020, Uplinq caters close to 1,000 SMBs throughout the US, covering sectors such as e-commerce, healthcare, logistics, and hospitality.Uplinq CEO and co-founder Alex Glenn said: “We are building more than just a platform—we are creating a new, innovative way for small businesses to manage their finances with the simplicity, accuracy, and insight they deserve.”Sign up for our daily news round-up!Give your business an edge with our leading industry insights.Sign upShareCopy LinkShare on XShare on LinkedinShare on FacebookMore RelevantNewsForvis Mazars expands with new office in BristolNewsBDO USA announces CEO’s retirement, names successorNewsAccounting technology startup Rillet raises $25mNewsSingapore leads global crypto job opportunities per capita"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://www.cnbctv18.com/business/startup/snabbit-startup-expansion-funding-home-help-services-19613407.htm",
    "title": "Snabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 months",
    "content": "HomeBusiness NewsStartup NewsSnabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 monthsSnabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 monthsSpeaking to CNBC-TV18, Founder and CEO Aayush Agarwal said the rapid follow-up round was driven by strong traction across new markets. “We’ve grown 5x in the last four months,” he said.ByShruti MishraMay 30, 2025, 9:03:11 PM IST(Published)2 Min ReadQuick-service home help platform Snabbit has raised $19 million in a Series B funding round led by Lightspeed, with continued backing from Elevation Capital and Nexus Venture Partners.The fresh capital comes just four months after the company closed its $5.5 million Series A, signalling strong investor confidence in its full-stack, execution-heavy model. The company now plans to aggressively expand into over 200 micro-markets across India’s top metros in the next nine months.Speaking to CNBC-TV18, Founder and CEO Aayush Agarwal said the rapid follow-up round was driven by strong traction across new markets. “We’ve grown 5x in the last four months,” he said. “It took us 150 days to hit 100 orders a day in Powai, but just eight days to do the same in Thane. That basically shows we’re executing well, and we need to double down on this momentum.”Snabbit, which calls itself India’s first hyperlocal home services platform, is trying to bring the ease of ordering a cab or food to the world of domestic help. “If you want any simple help at home, it’s very, very inconvenient. We said, let’s make getting home help as simple as booking a cab,” Agarwal said.The company follows a full-stack model where it handles sourcing, training, and managing its workforce in-house—unlike most gig platforms that only aggregate supply. “The only way to ensure quality, trust, and safety at scale is by owning the entire supply chain,” he added.Snabbit’s promise of delivering a trained service professional within 10 minutes rests on its tech-enabled, cluster-based network design. By focusing on dense neighbourhoods and demand forecasting, the company places its workforce closer to customers rather than relying on traditional logistics.What sets Snabbit apart is its focus on depth before scale. It spent 12 months perfecting the model in a single micro-market before expanding. That foundation is now powering its plans to enter hundreds of new clusters while maintaining service consistency and profitability.The platform also aims to redefine how domestic help is viewed and treated in India. “We don’t call them maids or gig workers. We call them experts,” Agarwal said. “This is a very different supply chain. We’re trying to bring dignity, structure, and recognition to a workforce that has long been marginalised.”Watch the accompanying video for moreContinue ReadingCheck out our in-depthMarket Coverage,Business News& get real-timeStock MarketUpdates on CNBC-TV18. Also, Watch  our channelsCNBC-TV18,CNBC AwaazandCNBC BajarLive on-the-go!TagsStartup fundingStartup Street"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://www.cnbctv18.com/business/startup/snabbit-startup-expansion-funding-home-help-services-19613407.htm",
    "title": "Snabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 months",
    "content": "HomeBusiness NewsStartup NewsSnabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 monthsSnabbit raises $19 million in Series B round, plans to enter 200 micro-markets in the next 9 monthsSpeaking to CNBC-TV18, Founder and CEO Aayush Agarwal said the rapid follow-up round was driven by strong traction across new markets. “We’ve grown 5x in the last four months,” he said.ByShruti MishraMay 30, 2025, 9:03:11 PM IST(Published)2 Min ReadQuick-service home help platform Snabbit has raised $19 million in a Series B funding round led by Lightspeed, with continued backing from Elevation Capital and Nexus Venture Partners.The fresh capital comes just four months after the company closed its $5.5 million Series A, signalling strong investor confidence in its full-stack, execution-heavy model. The company now plans to aggressively expand into over 200 micro-markets across India’s top metros in the next nine months.Speaking to CNBC-TV18, Founder and CEO Aayush Agarwal said the rapid follow-up round was driven by strong traction across new markets. “We’ve grown 5x in the last four months,” he said. “It took us 150 days to hit 100 orders a day in Powai, but just eight days to do the same in Thane. That basically shows we’re executing well, and we need to double down on this momentum.”Snabbit, which calls itself India’s first hyperlocal home services platform, is trying to bring the ease of ordering a cab or food to the world of domestic help. “If you want any simple help at home, it’s very, very inconvenient. We said, let’s make getting home help as simple as booking a cab,” Agarwal said.The company follows a full-stack model where it handles sourcing, training, and managing its workforce in-house—unlike most gig platforms that only aggregate supply. “The only way to ensure quality, trust, and safety at scale is by owning the entire supply chain,” he added.Snabbit’s promise of delivering a trained service professional within 10 minutes rests on its tech-enabled, cluster-based network design. By focusing on dense neighbourhoods and demand forecasting, the company places its workforce closer to customers rather than relying on traditional logistics.What sets Snabbit apart is its focus on depth before scale. It spent 12 months perfecting the model in a single micro-market before expanding. That foundation is now powering its plans to enter hundreds of new clusters while maintaining service consistency and profitability.The platform also aims to redefine how domestic help is viewed and treated in India. “We don’t call them maids or gig workers. We call them experts,” Agarwal said. “This is a very different supply chain. We’re trying to bring dignity, structure, and recognition to a workforce that has long been marginalised.”Watch the accompanying video for moreContinue ReadingCheck out our in-depthMarket Coverage,Business News& get real-timeStock MarketUpdates on CNBC-TV18. Also, Watch  our channelsCNBC-TV18,CNBC AwaazandCNBC BajarLive on-the-go!TagsStartup fundingStartup Street"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://yourstory.com/2025/05/battery-smart-secures-29m-ongoing-series-b-round",
    "title": "Battery Smart secures $29M in ongoing Series B round",
    "content": "ADVERTISEMENTAdvertise with usFundingBattery Smart secures $29M in ongoing Series B roundBattery Smart intends to use the newly raised funds to deepen its presence in existing markets and expand into new cities.Sai Keerthi460 StoriesFriday May 30, 2025,2 min ReadFOLLOW USBattery swapping operator Battery Smart has raised $29 million as part of its ongoing Series B round, a source familiar with the matter toldYourStory.Inc42was the first to report on this matter.According to the report, New York-based private equity firm Rising Tide Energy led the funding round, which also saw participation from responsAbility, Ecosystem Integrity Fund, and LeapFrog Investments.Battery Smart did not respond toYourStory’s request for comment.The source added that the company intends to use the newly raised funds to strengthen its presence in existing cities and expand into new markets.Also ReadBattery Smart reports 195% rise in FY24 revenue from operationsBattery Smart, which operates over 1,518battery swapping stationsat more than 321 stations in Delhi, last raised $73.9 million in May 2024, which sawparticipationfrom Blume Ventures, LeapFrog Investments, and responsAbility, among others, according to data from Tracxn.The Gurugram-based company was valued at $451 million, as of May 8, 2025. The Tiger Global-backed company has a 36% market share, according to Tracxn, andcompeteswith VoltUp, SUN Mobility, and Mooving.Founded by Pulkit Khurana and Siddharth Sikka, the company offers Lithium-ion battery swapping services to electric three-wheelers and two-wheelers through its swapping network.According to the company’s website, it has conducted over 74.9 million swaps since its inception and has onboarded over 68,036 EV drivers onto its network.Battery swapping is an alternative to traditional charging, which reduces the charging time of a vehicle and encourages higher asset utilisation. This has made it a compelling choice for commercial use cases, especially in sectors like last-mile delivery and shared mobility.Edited by Suman SinghADVERTISEMENTAdvertise with usADVERTISEMENTAdvertise with usMOST VIEWED STORIES1BooksJune reading list: 5 Books to reignite your mid-year drive2Books5 Short books with lessons perfect for your weekend reads3AI GenGoogle Chrome's Split-Screen Feature: A Game Changer for Browsing4InnovationRajasthan 2035: Col Rajyavardhan Rathore unveils a vision where policy meets innovation5In-focusHow Retrod is empowering small hotels across IndiaADVERTISEMENTAdvertise with usADVERTISEMENTAdvertise with us"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://financialit.net/news/fundraising-news/monarch-secures-75-million-series-b-funding-expand-financial-wellness-platform",
    "title": "Monarch Secures $75 Million in Series B Funding to Expand Financial Wellness Platform | Financial IT",
    "content": "BREAKING NEWSWorldpay and Exodus Team Up: Pioneering Native Card Payments for Self-Custodial Crypto WalletsMiniPay Launches iOS Wallet App to Bring Stablecoin to Millions More ConsumersdLocal and PayPal Expand Access to Local Payments Across Emerging MarketsGFT Expands AI Compliance to Protect the $236.6B Canadians Entrust in Credit UnionsHSBC Launches TradePay for Import Duties Solution for US ClientsRevolut Selects Fourthline as Identity PartnermyTU Unlocks New Payment Infrastructure with Visa and Mastercard Acquiring Licensespayabl. Leverages Sift’s AI-Powered Fraud Platform to Protect Businesses from FraudPliant Closes $40 Million Series B Funding to Expand Into the U.S. MarketMonarch Secures $75 Million in Series B Funding to Expand Financial Wellness PlatformFundraising News30.05.202501:15 pmMonarchhas announced the successful raise of $75 million in Series B financing. The round was co-led by Wesley Chan of FPV Ventures and Eurie Kim of Forerunner Ventures, with participation from existing investors Menlo Ventures, Accel, SignalFire, and Clocktower Ventures.Financial health remains one of the most pressing societal challenges today. Research shows that financial concerns are the leading source of household stress, a primary factor in divorce, and a significant contributor to mental health issues such as depression and anxiety.Monarch was founded six years ago with a bold and clear mission: to solve this problem for all households—not just the wealthy. The company believes that everyone, regardless of their starting point, can improve their financial situation with the right tools, information, and guidance.Related NewsStitch Secures $10 Million in Funding to Simplify...30.05.202507:55 amKashable Secures $250 Million Credit Facility to...29.05.202504:10 pmHusk Secures €1M to Revolutionize Startup Finance29.05.202502:05 pmAuditstage Raises €750.000 from Smartfin to...29.05.202501:45 pmRillet Raises $25M Series A From Sequoia Capital to...29.05.202508:45 amOutmin Raises €4M to Scale AI Bookkeeping, Names Ex-...28.05.202503:25 pmRevenueCat Raises $50M Series C to Expand Global...23.05.202504:15 pmOpenFX Raises $23M in Initial Funding to Revolutionize...23.05.202507:25 amKeep Raises C$108M to Transform Small Business Banking...22.05.202502:15 pmGreenlite AI Raises $15M Series A to Help Banks and...22.05.202502:05 pmAcrisure Secures $2.1 Billion Funding Round Led by...21.05.202505:15 pmAirwallex Raises $300 Million at a $6.2 Billion...21.05.202511:05 amLatest IssueFree Newsletter SubscriptionLeave this field blankFinTech ListPayment gatewaysChallenger banksChallenger banksChallenger banksChallenger banksPopular TagsBankingDataConsultancyTransaction BankingRegTechSecurity/ComplianceCloudTrading SystemsBlockchainFinTech StartUpsM&A DealsInfrastructureArtificial Intelligence"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://www.vccircle.com/alphawave-tiger-global-backed-oxyzo-plans-series-b-funding-round",
    "title": "Alpha Wave, Tiger Global-backed Oxyzo plans Series B funding round",
    "content": "FOLLOW USABOUT USADVERTISE WITH USCONTACT USCOPYRIGHTPRIVACY POLICYTERMS OF USECOMPANY LISTINGTAG LISTINGRESOURCE LIBRARYOUR PRODUCTSTECHCIRCLEVCCEDGEEVENTSTRAININGSALESEDGEEDGE INSIGHTSBECOME APREMIUM MEMBERPREMIUMDOWNLOAD OUR APP"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://www.orrick.com/en/News/2025/05/Zeno-Power-Raises-Series-B-to-Advance-Nuclear-Battery-Development",
    "title": "HTTP 403",
    "content": "Failed to access https://www.orrick.com/en/News/2025/05/Zeno-Power-Raises-Series-B-to-Advance-Nuclear-Battery-Development: 403 Client Error: Forbidden for url: https://www.orrick.com/en/News/2025/05/Zeno-Power-Raises-Series-B-to-Advance-Nuclear-Battery-Development"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://pulse2.com/siro-50-million-series-b-raised-for-ai-based-conversation-intelligence-platform/",
    "title": "Siro: $50 Million Series B Raised For AI-Based Conversation Intelligence Platform",
    "content": "Siro, an AI-based conversation intelligence platform for in-person sales, announced it has raised $50 million in Series B funding led by SignalFire, with participation from 01 Advisors, StepStone Group, and existing investors CRV, Fika Ventures, and Index Ventures.How Siro works:With Siro’s mobile app, reps record their in-person sales conversations. Then AI transcribes and analyzes the recordings, surfacing key insights, coaching opportunities, and revenue-driving behaviors. Sales teams utilizing Siro have seen 36% higher close rates, 30% lower rep turnover, and 10x faster coaching cycles.Launched in 2020, Siro grew rapidly, with hundreds of customers across industries like home improvement, med spas, and wholesale distribution. And Siro CEO Jake Cronin, a former top Cutco rep and McKinsey alum, started Siro to make in-person sales a more accessible path to financial freedom.Value proposition:As technology has advanced rapidly for remote work and digital sales, field sales teams have been left behind. And Siro changes that by turning real-world conversations into structured, searchable data, giving companies visibility into what’s actually happening at the kitchen table, on the job site, or in the showroom.How the funding will be used:The funding will be used to accelerate product development and expand the team across engineering, sales, and customer success.KEY QUOTES:“As an AI and data company ourselves, we at SignalFire are very interested in companies building vertical specific data moats. Siro’s solution is helping digitize the ‘dark matter’ of offline conversations comprising field sales engagements, which has broad extensibility across verticals and depth in downstream actions that can be instrumented from this data – such as customer and product insights.”Wayne Hu, Managing Director at SignalFire“Sales changed the trajectory of my life. This raise helps us build the tools to help others do the same.”Siro CEO Jake Cronin"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://alleywatch.com/2025/05/global-startup-funding-top-largest-april-2025-vc/",
    "title": "The 13 Largest Global Startup Funding Rounds of April 2025",
    "content": "Armed with some data from our friends at CrunchBase, I broke down the largest global startup funding rounds for April 2025. I have included some additional information such as industry, round type, a brief description of the company, investors in the round, company location, and total equity funding raised for the company to further the analysis.13.SandboxAQ$150.0MRound:Series EDescription:Palo Alto-based SandboxAQ develops AI and quantum technology solutions that enhance biopharma, cybersecurity, and materials science. Founded by Jack Hidary in 2016,SandboxAQhas now raised a total of $950.0M in total equity funding and is backed by NVIDIA, Google, BNP Paribas, S32, and US Innovative Technology Fund.Investors in the round:Beyond Alpha Ventures, BNP Paribas, Google, Horizon Kinetics LLC, NVIDIA, Ray DalioIndustry:Artificial Intelligence (AI), Cyber Security, Information Technology, Quantum Computing, SaaSFounders:Jack HidaryFounding year:2016Location:Palo AltoTotal equity funding raised:$950.0M13.Thunes$150.0MRound:Series DDescription:Singapore-based Thunes provides a global payments infrastructure that enables businesses and financial to send and receive funds in various currencies. Founded by Eric Barbier and Peter Caluwe in 2016,Thuneshas now raised a total of $352.0M in total equity funding and is backed by Insight Partners, Bessemer Venture Partners, Checkout.com, Vitruvian Partners, and Endeavor Catalyst.Investors in the round:Apis Partners, Vitruvian PartnersIndustry:Financial Services, FinTech, Mobile Payments, PaymentsFounders:Eric Barbier, Peter CaluweFounding year:2016Location:SingaporeTotal equity funding raised:$352.0M12.Altruist$152.0MRound:Series FDescription:Culver City-based Altruist is a modern custodian that offers a digital investment platform for financial advisors to manage their clients’ investments. Founded by Jason Wenk in 2018,Altruisthas now raised a total of $601.5M in total equity funding and is backed by Insight Partners, ICONIQ Growth, Venrock, Salesforce Ventures, and Endeavor Catalyst.Investors in the round:Baillie Gifford, Carson Family Office, Geodesic Capital, GIC, ICONIQ Growth, Salesforce VenturesIndustry:Asset Management, Financial Services, FinTechFounders:Jason WenkFounding year:2018Location:Culver CityTotal equity funding raised:$601.5MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.11.Tailscale$160.0MRound:Series CDescription:Toronto-based Tailscale is a software company that provides zero-configuration virtual private networks (VPNs) for secure connectivity. Founded by Avery Pennarun, David Carney, and David Crawshaw in 2019,Tailscalehas now raised a total of $275.0M in total equity funding and is backed by Accel, Insight Partners, Uncork Capital, Inovia Capital, and Heavybit.Investors in the round:Accel, Anthony Casalena, CRV, Heavybit, Insight Partners, Uncork CapitalIndustry:Cyber Security, Information Technology, Infrastructure, Network SecurityFounders:Avery Pennarun, David Carney, David CrawshawFounding year:2019Location:TorontoTotal equity funding raised:$275.0M10.Electra$186.0MRound:Series BDescription:Boulder-based Electra produces clean iron using low-temperature electrochemistry powered by renewables to decarbonize and transform steel production. Founded by Sandeep Nijhawan in 2020,Electrahas now raised a total of $299.3M in total equity funding and is backed by National Science Foundation, Lowercarbon Capital, Temasek Holdings, Valor Equity Partners, and S2G Investments.Investors in the round:BHP Ventures, Breakthrough Energy Ventures, Builders Vision, Capricorn Investment Group, Collaborative Fund, Earth Venture Capital, Interfer, Lowercarbon Capital, Nucor Corporation, Rio Tinto, Roy Hill, S2G Investments, Temasek Holdings, Toyota Tsusho, Yamato KogyoIndustry:Energy, Industrial, Renewable EnergyFounders:Sandeep NijhawanFounding year:2020Location:BoulderTotal equity funding raised:$299.3M9.Apex$200.0MRound:Series CDescription:Los Angeles-based Apex designs and manufactures satellite buses tailored for various space missions. Founded by Ian Cinnamon and Maximilian Benassi in 2022,Apexhas now raised a total of $322.0M in total equity funding and is backed by StepStone Group, Andreessen Horowitz, Village Global, 8VC, and Lux Capital.Investors in the round:8VC, Andreessen Horowitz, Point72 Ventures, StepStone Group, Washington Harbour PartnersIndustry:Aerospace, Commercial, ManufacturingFounders:Ian Cinnamon, Maximilian BenassiFounding year:2022Location:Los AngelesTotal equity funding raised:$322.0MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.9.Base Power$200.0MRound:Series BDescription:Austin-based Base Power is a modern energy provider that specializes in residential backup battery systems and electricity plans. Founded by Zachary Dell in 2023,Base Powerhas now raised a total of $268.0M in total equity funding and is backed by Andreessen Horowitz, Valor Equity Partners, Lightspeed Venture Partners, Thrive Capital, and Altimeter Capital.Investors in the round:Addition, Altimeter Capital, Andreessen Horowitz, Jackson Moses, Lightspeed Venture Partners, Terrain, Thrive Capital, Trust Ventures, Valor Equity PartnersIndustry:Battery, Electrical Distribution, Energy, Energy Management, Energy Storage, Industrial, Power GridFounders:Zachary DellFounding year:2023Location:AustinTotal equity funding raised:$268.0M9.Persona$200.0MRound:Series DDescription:San Francisco-based Persona is an identity verification and management platform that enables businesses to automate and streamline their verification processes. Founded by Charles Yeh and Rick Song in 2018,Personahas now raised a total of $417.5M in total equity funding and is backed by Founders Fund, Coatue, Bond, First Round Capital, and Index Ventures.Investors in the round:Bond, Chemistry, Coatue, First Round Capital, Founders Fund, Index Ventures, Ribbit CapitalIndustry:Cyber Security, Fraud Detection, Identity Management, Information Technology, SaaSFounders:Charles Yeh, Rick SongFounding year:2018Location:San FranciscoTotal equity funding raised:$417.5M9.Supabase$200.0MRound:Series DDescription:San Francisco-based Supabase is an open-source Firebase alternative that provides a full PostgreSQL database. Founded by Anthony Wilson and Paul Copplestone in 2020,Supabasehas now raised a total of $396.1M in total equity funding and is backed by Y Combinator, Accel, Craft Ventures, Lightspeed Venture Partners, and Coatue.Investors in the round:Accel, Coatue, Craft Ventures, Felicis, Taylor Otwell, Y CombinatorIndustry:Artificial Intelligence (AI), Database, Developer Tools, Information Services, Information Technology, SoftwareFounders:Anthony Wilson, Paul CopplestoneFounding year:2020Location:San FranciscoTotal equity funding raised:$396.1MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.9.CMR Surgical$200.0MRound:VentureDescription:Cambridge-based CMR Surgical develops and manufactures robotic surgical systems to enhance precision and efficiency in minimally invasive surgery. Founded by Luke Hares, Mark Slack, and Martin Frost in 2014,CMR Surgicalhas now raised a total of $1.3B in total equity funding and is backed by Lightrock, Trinity Capital, Ally Bridge Group, SoftBank Vision Fund, and Cambridge Innovation Capital.Investors in the round:Trinity CapitalIndustry:Health Care, Medical, Medical Device, RoboticsFounders:Luke Hares, Mark Slack, Martin FrostFounding year:2014Location:CambridgeTotal equity funding raised:$1.3B8.Mainspring Energy$258.0MRound:Series FDescription:Menlo Park-based Mainspring Energy provides power generation technology using linear generators for clean energy. Founded by Adam Simpson, Matt Svrcek, and Shannon Miller in 2010,Mainspring Energyhas now raised a total of $726.0M in total equity funding and is backed by General Catalyst, Temasek Holdings, Khosla Ventures, Alumni Ventures, and Lightrock.Investors in the round:Climate Pledge Fund, DCVC, Gates Frontier Fund, General Catalyst, Khosla Ventures, LGT group, Lightrock, M&G Investments, Marunouchi Innovation Partners, Pictet Private Equity Investors S.A., Temasek HoldingsIndustry:Clean Energy, Energy, Oil and GasFounders:Adam Simpson, Matt Svrcek, Shannon MillerFounding year:2010Location:Menlo ParkTotal equity funding raised:$726.0M7.True Anomaly$260.0MRound:Series CDescription:Centennial-based True Anomaly is builds space security and resilience at the intersection of spacecraft, software, and autonomy. Founded by Even Rogers and Kyle Zakrzewski in 2022,True Anomalyhas now raised a total of $400.6M in total equity funding and is backed by Menlo Ventures, Accel, Rocketship.vc, Eclipse Ventures, and Riot Ventures.Investors in the round:645 Ventures, Accel, ACME Capital, Champion Hill Ventures, Eclipse Ventures, Menlo Ventures, Meritech Capital Partners, Narya Capital, Riot Ventures, Space.VCIndustry:Aerospace, Artificial Intelligence (AI), Manufacturing, Military, National SecurityFounders:Even Rogers, Kyle ZakrzewskiFounding year:2022Location:CentennialTotal equity funding raised:$400.6MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.6.Chaos$275.0MRound:Series CDescription:Los Angeles-based Chaos Industries develops advanced technologies for defense and critical industries. Founded by Bo Marr, Brett Cummings, Gavin Hood, and John Tenet in 2022,Chaoshas now raised a total of $490.0M in total equity funding and is backed by StepStone Group, Accel, Valor Equity Partners, 8VC, and New Enterprise Associates.Investors in the round:8VC, Accel, New Enterprise Associates, Overmatch Ventures, StepStone Group, Tru Arrow Partners, Valor Equity PartnersIndustry:Aerospace, Government, Military, National SecurityFounders:Bo Marr, Brett Cummings, Gavin Hood, John TenetFounding year:2022Location:Los AngelesTotal equity funding raised:$490.0M5.Runway$308.0MRound:Series DDescription:New York-based Runway is an applied AI research company that creates AI-powered content creation tools for the media and entertainment sectors. Founded by Alejandro Matamala Ortiz, Anastasis Germanidis, and Cristobal Valenzuela Barrera in 2018,Runwayhas now raised a total of $544.5M in total equity funding and is backed by General Atlantic, Madrona, NVIDIA, Google, and Lux Capital.Investors in the round:Baillie Gifford, Fidelity, General Atlantic, NVIDIA, SoftBankIndustry:Apps, Artificial Intelligence (AI), Generative AI, Machine Learning, Software, Video EditingFounders:Alejandro Matamala Ortiz, Anastasis Germanidis, Cristobal Valenzuela BarreraFounding year:2018Location:New YorkTotal equity funding raised:$544.5M4.DennoKotsu¥2.5BRound:Series DDescription:Tokushima-based Denno Kotsu specializes in taxi dispatch systems and contract dispatch services for taxi companies. Founded by Bando Yuki and Okada Ikuhiro in 2015,DennoKotsuhas now raised a total of $348.3M in total equity funding and is backed by Uber, Japan Post Investment, NTT DOCOMO Ventures, Mitsubishi Corporation, and Iyogin Capital.Investors in the round:Awagin Capital, DAIICHI KOUTSU SANGYO, Daiwa Motor Transportation, Iyogin Capital, Japan Post Investment, Kokusai Motorcars, Mitsubishi Corporation, MK, Sanwa Transportation, Tokushima Taisho Bank, Tsubame Motors, UberIndustry:Automotive, Software, Task Management, Taxi Service, TransportationFounders:Bando Yuki, Okada IkuhiroFounding year:2015Location:TokushimaTotal equity funding raised:$348.3MTheTechWatch Media Groupaudience is driving progress and innovation on a global scale. With its regional media properties (NYC Tech,LA Tech,London Tech)TechWatch Media Group is the highway for technology and entrepreneurship. There are a number of options to reach this audience of the world’s most innovative organizations and startups at scale including developing prominent brand placement, driving demand generation, and building thought leadership among the vast majority of key influencers in the global business community and beyond. Find out how to partner with us to drive a return on your marketing investmenthere.3.Chainguard$356.0MRound:Series DDescription:Kirkland-based Chainguard is a cloud-native development platform that provides low-to-zero CVE container images for building and running applications. Founded by Dan Lorenc, Kim Lewandowski, and Ville Aikas in 2021,Chainguardhas now raised a total of $612.0M in total equity funding and is backed by Sequoia Capital, Lightspeed Venture Partners, IVP, Spark Capital, and Salesforce Ventures.Investors in the round:Amplify Partners, Datadog Ventures, IVP, Kleiner Perkins, Lightspeed Venture Partners, MANTIS Venture Capital, Redpoint, Salesforce Ventures, Sequoia Capital, Spark Capital, Windproof Partners (fka Kerrest & Co.)Industry:Cloud Security, Developer Tools, Enterprise Software, Open Source, SecurityFounders:Dan Lorenc, Kim Lewandowski, Ville AikasFounding year:2021Location:KirklandTotal equity funding raised:$612.0M2.Plaid$575.0MRound:VentureDescription:San Francisco-based Plaid develops financial technology infrastructure that enables applications to connect with users’ bank accounts and financial data. Founded by William Hockey and Zachary Perret in 2013,Plaidhas now raised a total of $1.3B in total equity funding and is backed by Franklin Templeton, Norwest Venture Partners, Andreessen Horowitz, BoxGroup, and BlackRock.Investors in the round:BlackRock, Fidelity, Franklin Templeton, New Enterprise Associates, Ribbit CapitalIndustry:Banking, Financial Services, FinTech, InsurTech, Wealth ManagementFounders:William Hockey, Zachary PerretFounding year:2013Location:San FranciscoTotal equity funding raised:$1.3B1.Safe Superintelligence$2.0BRound:VentureDescription:Palo Alto-based Safe Superintelligence develops AI solutions prioritizing safety in artificial intelligence. Founded by Daniel Gross, Daniel Levy, and Ilya Sutskever in 2024,Safe Superintelligencehas now raised a total of $3.0B in total equity funding and is backed by Andreessen Horowitz, NVIDIA, Sequoia Capital, Lightspeed Venture Partners, and Alphabet.Investors in the round:Alphabet, Andreessen Horowitz, DST Global, Greenoaks, Lightspeed Venture Partners, NVIDIAIndustry:Artificial Intelligence (AI), Information Technology, Internet, Software EngineeringFounders:Daniel Gross, Daniel Levy, Ilya SutskeverFounding year:2024Location:Palo AltoTotal equity funding raised:$3.0BTags:645 Ventures8VCAccelACME capitalAdam SimpsonAdditionAlejandro Matamala OrtizAlphabetAltimeter CapitalAltruistAmplify PartnersAnastasis GermanidisAndreessen HorowitzAnthony CasalenaAnthony WilsonApexApis PartnersAvery PennarunAwagin CapitalBaillie GiffordBando YukiBase PowerBeyond Alpha VenturesBHP VenturesBlackRockBNP ParibasBo MarrBONDBreakthrough Energy VenturesBrett CummingsBuilders VisionCapricorn Investment GroupCarson Family OfficeChainguardChampion Hill VenturesChaosCharles YehChemistryClimate Pledge FundCMR SurgicalCoatueCollaborative FundCraft VenturesCristobal Valenzuela BarreraCRVDAIICHI KOUTSU SANGYODaiwa Motor TransportationDan LorencDaniel GrossDaniel LevyDatadog VenturesDavid CarneyDavid CrawshawDCVCDennoKotsuDST GlobalEarth Venture CapitalEclipse VenturesElectraEric BarbierEven RogersFelicisFidelityFirst Round CapitalFounders FundFranklin TempletonGates Frontier fundGavin HoodGeneral CatalystGeodesic CapitalGICGoogleGreenoaksHeavybitHorizon Kinetics LLCIan CinnamonICONIQ GrowthIlya SutskeverIndex VenturesInsight PartnersInterferIVPIyogin CapitalJack HidaryJackson MosesJapan Post InvestmentJason WenkJohn TenetKhosla VenturesKim LewandowskiKleiner PerkinsKokusai MotorcarsKyle ZakrzewskiLGT groupLightrockLightspeed Venture PartnersLowercarbon CapitalLuke HaresM&G InvestmentsMainspring EnergyMANTIS Venture CapitalMark SlackMartin FrostMarunouchi Innovation PartnersMatt SvrcekMaximilian BenassiMenlo VenturesMeritech Capital PartnersMitsubishi CorporationMKNarya CapitalNew Enterprise AssociatesNucor CorporationNvidiaOkada IkuhiroOvermatch VenturesPaul CopplestonePersonaPeter CaluwePictet Private Equity Investors S.A.PlaidPoint72 VenturesRay DalioRedpointRibbit CapitalRick SongRio TintoRiot VenturesRoy HillRunwayS2G InvestmentsSafe SuperintelligenceSalesforce VenturesSandboxAQSandeep NijhawanSanwa TransportationSequoia CapitalShannon MillerSoftBankSpace.VCSpark CapitalStepStone GroupSupabaseTailscaleTaylor OtwellTemasek HoldingsTerrainThrive CapitalThunesTokushima Taisho BankToyota TsushoTrinity CapitalTru Arrow PartnersTrue AnomalyTrust VenturesTsubame MotorsUberUncork CapitalValor Equity PartnersVille AikasVitruvian PartnersWashington Harbour PartnersWilliam HockeyWindproof PartnersY CombinatorYamato KogyoZachary DellZachary Perret"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://ipocentral.in/snitch-to-raise-280-cr-in-series-b-round-led-by-360/",
    "title": "D2C Menswear Brand Snitch to Raise INR 280 Cr in Series B Round, Led by 360 One",
    "content": "NewsStartup FundingD2C Menswear Brand Snitch to Raise INR 280 Cr in Series B Round, Led by 360 OneByAnurag Gupta-May 30, 20250Snitch, the Bengaluru-based direct-to-consumer (D2C) menswear brand, is raisingINR 278.93 crore (~USD 33 million)in its Series B round. The round is led by 360 One Asset Management Fund with participation from existing investors SWC Global and IvyCap Ventures.Snitch Series B Round – Key PointsFunding Amount:INR 278.93 Cr (USD 33 million)Lead Investor:360 One Asset Management (Formerly IIFL Wealth & Asset Management)Other Investors:SWC Global, IvyCap VenturesPost-Money Valuation:Approx. INR 2,500 Cr (~USD 294 million)Shares Issued:1,755 Series B CCPS at INR 15.89 Lakh eachFounder’s Stake Post Allotment:47.12%Use of Funds:Product diversification, offline expansion and global entryThis is a 5x increase in valuation from the previous INR 500 Cr in Series A round in December 2023 when it raised INR 110 Cr from the same set of institutional investors. According to the RoC filings, the latest round is a preferential allotment of 1,755 Series B CCPS at a premium of INR 15,89,385 per share.Breakup of Investment360 One Asset Management:INR 220.12 Cr (~USD 25.9 million)SWC Global:INR 29.4 CrIvyCap Ventures:INR 29.4 CrPost allotment, 360 One will have 9.67% stake in the company while IvyCap and SWC will remain the largest external shareholders with 10.39% and 10.17% respectively.Growth Story and StrategyFounded in 2019 by Siddharth Dungarwal, Snitch started as a B2B apparel supplier and then pivoted to D2C during the COVID-19 disruption. Today it is an omnichannel player in India’s fast fashion space which includes global giants like H&M and local peers likeThe Souled Store,Rare RabbitandWrogn.The brand offers a wide range of menswear including shirts, co-ords, jackets, sweaters, hoodies, jeans, innerwear and accessories. Snitch sells through its website, mobile app and increasingly through offline stores.As of May 2025, the company has 58-59 physical stores across India in cities like Bengaluru, Delhi, Mumbai and several locations in Gujarat. 40-45% of Snitch’s revenue comes from offline.FinancialsSnitch has seen tremendous growth in the last few years. For FY24 (ended March 2024) it reported:Revenue:INR 241–243 Cr (100%+ YoY growth)Net Profit:INR 4.39 Cr (up from INR 3.1 Cr in FY23)According to unaudited figures shared by Dungarwal, Snitch has done INR 520 Cr in FY25—2.2X growth YoY—and expects to close the year with net profits of INR 40 Cr.Looking ahead, Snitch has big plans to:Open50 new storesin the next 5–6 monthsLaunchnew product categorieslikepluswear,bags,footwear,sunglassesStartglobal expansionwith a pilot inMiddle EastThe brand’s strategy is to deliver fast fashion at scale with rapid design cycles and strong data analytics on consumer preferences. This D2C model has worked well with Indian millennials and Gen Z, making Snitch a youthful, trend-led fashion brand with online agility and offline presence.Outlook and Final WordsSnitchgot early visibility throughShark Tank India Season 2where it raised INR 1.5 Cr for 1.5% equity at INR 100 Cr valuation from a consortium of well-known investors including Anupam Mittal, Aman Gupta, Peyush Bansal and others. This Series B is 25x valuation from Shark Tank days, further proving the brand’s growth in Indian retail fashion space.With strong financials, big plans and investor confidence, Snitch is finding its space in Indian D2C fashion landscape. As it looks to go IPO and global, the brand is the story of Indian startups moving from scrappy disruptors to global players.For more details related toIPO GMP,SEBI IPO Approval, andLive Subscriptionstay tuned toIPO Central.Previous articleSom Datt Finance Rights Issue Dates, Price, Allotment, EntitlementNext articleProstarm Info Systems IPO Allotment Today: What to Expect After 39x Retail OversubscriptionAnurag Gupta"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://www.thehindu.com/sci-tech/technology/grammarly-secures-1-billion-from-general-catalyst-to-build-ai-productivity-platform/article69636439.ece",
    "title": "Grammarly secures $1 billion from General Catalyst to build AI productivity platform",
    "content": "Grammarly has raised $1 billion in non-dilutive financing from General Catalyst to expand its artificial intelligence (AI) offerings, aiming to grow into a comprehensive productivity platform, the companies said on Thursday.Grammarly, known for its popular writing assistant tool, plans to use the capital to fund sales and marketing costs and strategic acquisitions. It looks to use AI to build more communication-based productivity tools and even hosts third-party tools on its platform by leveraging access to its 40 million daily users. The investment, one of the biggest out of General Catalyst's Customer Value Fund (CVF), could help late-stage tech companies like Grammarly accelerate growth by using dedicated capital to acquire new customers. By reallocating funds typically tied up in sales and marketing, Grammarly can invest more in product development.In return, General Catalyst doesn't receive an equity stake in Grammarly, but will get a capped return linked to revenue generated through using this capital. This is structured as a percentage of the revenue generated from the fund being used in customer acquisition.Founded in 2009, Grammarly has an annual revenue exceeding $700 million and is profitable. In December, Grammarly appointed Shishir Mehrotra, previously CEO of the acquired productivity platform Coda, as its new leader, signaling a push into broader AI-powered workplace tools.\"As Grammarly is going through a huge transformation of going from being a what is mostly known as a single-purpose agent to being an agent platform, it just felt very important for us to be able to bet big in our product development and in M&A as well as in our growth strategies,\" Mehrotra said in an interview.AI startups drive VC funding resurgence, capturing record U.S. investment in 2024He added said the company has an eventual goal to go public, although no imminent plans.\"I'm right now just focused on making sure we're innovating with new products, growing as fast as we can. But when we feel ready, we'll go public,\" Mehrotra added.The dedicated growth investment, if it pays off, could also benefit the valuation of Grammarly and General Catalyst's stake in the company, as it has also been an equity investor in Grammarly's series B funding in 2017.San Francisco-based Grammarly has raised over $550 million in venture capital, according to PitchBook. It was last valued at $13 billion in 2021.General Catalyst’s Customer Value Fund operates apart from the firm's main venture funds with separate limited partners, and is not included in the newly raised $8 billion fundraising the firm announced.This approach is part of a strategic evolution for the tech investor, led by CEO Hemant Taneja, as it seeks to grow beyond the traditional venture capital model, including creating innovative funding mechanisms.Its customer acquisition fund has invested in nearly 50 companies, including Lemonade and Fivetran, as it leads on growth metrics to a more predictable path to returns.\"Companies like Grammarly basically have a machine where they can invest dollars in sales and marketing and generate a very consistent return,\" said Pranav Singhvi, Managing Director at General Catalyst, \"With this wave of AI, giving Grammarly the firepower to actually go and invest could land those customers beyond the 40 million.\"Published- May 30, 2025 10:09 am ISTRead  CommentsCopy linkEmailFacebookTwitterTelegramLinkedInWhatsAppRedditREAD LATERRemoveSEE ALLPRINTRelated storiesIn 2024, artificial intelligence was all about putting AI tools to workGrammarly app review | An impressive AI-powered digital writing assistant with glitchesRelated Topicstechnology (general)/internet/Artificial Intelligence/emerging technologies/science and technology"
  },
  {
    "alert_name": "Google Alert - Funding Series B",
    "date": "2025-05-30",
    "url": "https://inc42.com/buzz/battery-smart-bags-29-mn-from-rising-tide-energy-others/",
    "title": "Exclusive: Battery Smart Bags $29 Mn From Rising Tide Energy, Others",
    "content": "Clean TechExclusive: Battery Smart Bags $29 Mn From Rising Tide Energy, Others30 May'25| ByDebarghya SilFOLLOW USFOLLOW USAdded to Saved Stories in LoginVIEW SAVED STORIESDelhi NCR-based battery swapping startupBattery Smarthas raised $29 Mn in its ongoing Series B extension round, sources told Inc42.New York-based PE firm Rising Tide Energy led the round, which also saw participation from responsAbility, Ecosystem Integrity Fund, and LeapFrog Investments.Confirming the development, Battery Smart said that it has raised the funds as part of an ongoing round. The startup said it is still in discussions with potential investors for raising additional funds.Battery Smart said it will utilise the capital to deepen its presence in existing cities and drive expansion into new markets.The funding round comes almost a year after the startup raised$65 Mn in its Series B round led by LeapFrog Investmentsat a post-money valuation of $340 Mn. The round also saw participation from Japan’s MUFG Bank, Blume Ventures, British International Investments, among others.The Series B round provided a partial exit to early investors, including Orios Venture Partners.Founded in 2020 by IIT Kanpur graduates Pulkit Khurana and Siddharth Sikka, Battery Smart offers battery swapping solutions and charging infrastructure across the country. Currently, it has the highest number of swapping stations in Delhi NCR.Including the latest funding, the startup has raised a total funding of over $139 Mn to date from investors like Tiger Global, Blume Ventures, among others.On the financial front, Battery Smart’s net loss almost doubled to INR 120 Cr in FY24 from INR 63.6 Cr in the previous year. However, operating revenue surged 196% to INR 164 Cr from INR 55.4 Cr in FY23.The startup competes against Chargeup, Sun Mobility, RACEnergy, among others.ExclusiveBattery SmartBattery SwappingBattery TechClean TechElectric VehiclesNote: We at Inc42 take our ethics very seriously. More information about it can be foundhere."
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://econsultancy.com/pharma-healthcare-brands-success-social-media/",
    "title": "Four pharma campaigns that made an impact on social media",
    "content": "ArticleFour pharma campaigns that made an impact on social mediaUsing social media as a pharma brand can feel like a risky exercise due to regulatory constraints – but social can be impactful for pharma companies when used in the right way. Here are four examples of campaigns that resonated.ByJames SmartMay 29th 202514:59Image: ShutterstockThe high regulatory standards to which pharma companies are held pose a hurdle when it comes to using social media.In the UK, for example, thePrescription Medicines Code of Practice Authority(PMCPA) prohibits the promotion of prescription-only medicines (POMs) to the public. Many markets have similar guidelines, and even in the United States, which allowsdirect promotion, aban on pharma advertisingon certain channels is currentlyunder discussion.As a result, many brands have opted to remain passive on social media. If pharma companies plan carefully, however, social media can be a unique and inventive way to drive awareness and engagement.Some of the best campaigns tell compelling, personal stories that can bring a condition’s challenges – not to mention a treatment’s benefits – to life. This can accomplish goals like increasing brand recognition, upping reach and improving sentiment, all without being directly promotional. From emotive HIV interviews to a gamified Snapchat lens, here are four stand-out examples of pharma campaigns that played to social media’s strengths while achieving marketing objectives.Navigating HIV: real voices and empathyLondon-basedViiV Healthcarehas around a third of the global HIV therapy market. Yet while both the health outcomes of HIV and public attitudes to the disease have transformed over the last 50 years, HIV can still be hard to talk about.Viiv foundthat three-quarters of people living with HIV admitted to withholding at least one concern from their doctor, with many reluctant to discuss safe sex and sexual health. They believed that promoting the value of honest, intimate conversations could resonate and shift the dial around awareness.The company collaborated with The Skin Deep, whospecialize in emotionally-charged video interviews, to present stories that could shine a light on the lives and perspectives of people with HIV. The campaign,Navigating HIV, featured a series of one-on-one conversations between healthcare providers, advocates and people living with HIV. Some pairs consisted of an existing patient and their doctor, while others were introduced for the first time.Thisunscripted approachresulted in honest, direct conversations about resilience, support and the way HIV is perceived. Numerous clips were shared across Instagram and TikTok, with in-depth (12–18 minute) episodes hosted on The Skin Deep’sYouTube channel.Navigating HIV launched in September 2024, and among its results were:more than 1.7 million organic views across Instagram, YouTube and TikTok over the ensuing three monthsInstagram posts gathered an average of more than 600 engagements eachfollowed with a paid media component that drove more than 600,000 video views.ViiV’s campaign illustrates the importance of high-quality video on social. It’s also a lesson in the value of finding authentic voices and letting them speak to a real problem, in the form of the communication gap around HIV, so that a campaign feels substantial, necessary and involving, rather than contributing to content overwhelm.The work shows how pharma can be mindful of regulations (no products are promoted, and videos underline that people should consult local medical authorities for advice) but still start a serious conversation with viral traction across multiple channels.Organon goes undercover to spotlight misdiagnosis of women’s heart attacksTrusted voices are at the heart of another successful use of social media, this time in the Middle East. US pharmaceutical giantOrganon, whichspecialises in women’s health,found thatcardiovascular diseases are responsible for one in three women’s deaths globally – five times as many as breast cancer. This is largely due to a historic medical bias that excluded women from clinical trials and so made their symptoms less recognisable than those suffered by men.To build a compelling, evidence-based narrative that could speak to women in Kuwait, Bahrain, Lebanon, Egypt, Saudi Arabia and UAE, Organon worked with MullenLowe and McCann Health. They began by:asking 4,000 Arabic women if they knew the signs of a woman’s heart attack – 97.4% didn’tsending a woman, dubbed ‘Mis[s]diagnosed’, undercover to meet medical professionals across the region showing the less known signs of female heart attacks – 83% missed thempackaging the data and her story inside ‘Awareness Aid kits’ and sending them to healthcare workers, doctors and influencers, urging them to share the signs.The 2023-4 campaign reached more than 28 million women and delivered a 24% uplift in social engagement for Organon. Like ViiV, Organon’s success came in part because it found a cause that needed attention.But that wouldn’t have worked without the campaign’s careful groundwork, in the form of research and swish kits, that engaged expert influencers, who brought trust and authority to the campaign. Organon branding on the video and kit packaging meant the brand was heavily linked to the campaign, even if no products were promoted.Dulcolax challenges poo taboos on social mediaOver-the-counter medications are subject to less strict promotional regulation, but tactics to challenge attitudes and make social campaigns interactive are just as important in the space.Dulcolax, a laxative brand, has leaned into the fact that conversations about using the toilet can often be taboo, putting this at the heart of multiple campaigns. One study commissioned by the brand found that 77% of Portuguese women have experienced constipation, with over a millionbelieving that the stigma they experienced as girls still keeps them from using the toilet on dates or when using public transport.The brand addressed this in a2024 campaignwithMRM Brazil and Weber Shandwick that used generative AI to create imagery of pooing princesses (via a custom model, as GenAI has its own restrictions on toilet imagery). The campaign ran across social media, OOH, and evena book called “The Princess and the Poo”, while anInstagram AR filterallowed users to see themselves as their own versions of pooing princesses.View this post on InstagramA post shared by DulcoLax Portugal (@dulcolax.pt)Research around taboos also fuelled a campaign that challenged habits in the UK. According to Dulcolax, while the number of constipation sufferers is increasing, the laxative category is on the decline.Identifying that on X, one in 13 posts contain the word “shit”, Dulcolaxworked with agency Hearts & Scienceto respond to tweets that used the word, offering up positive “shit talk”. The brand gavelight-hearted medical advice on topics such as fibre-rich foods and the right way to deal with constipation. The result was that positive sentiment rose by 55%, and sales increased by 6%.Alberto Hernandez, then-chief growth officer at Sanofi Consumer Healthcare, which owns Dulcolax,toldThe Drumthat Dulcolax’s bold campaigns resulted from a change of mindset towards healthcare advertising.“There is a little bit of weight that [healthcare advertisers] carry with us that hasn’t allowed us to unlock the potential of our brands to the degree that other industries have been able to do, even if they’re regulated,” he said. “…The relief we can generate can create an emotional connection with a brand that is far beyond any other industry. The only thing is that we have been our worst enemy.”The relief we can generate can create an emotional connection with a brand that is far beyond any other industry.Snapchat lens breaks records for VTAMAWe’ve seen how digging into real problems can power video and influencer awareness campaigns. In the US, brands can promote treatments directly to consumers, which has led to fun and hard-hitting campaigns.These playful, inventive approaches can prove hugely successful. Take Dermavent’s VTAMA cream, a treatment for the dry skin condition plaque psoriasis. VTAMA enlisted health agency 21GRAMS for a campaign timed to coincide with World Psoriasis Day in October 2023. According to VTAMA, plaque psoriasis sufferers arefive times more likelyto be gamers than the general population, while 89% of gamers say playing offers them stress relief, with stress a common trigger of skin flare-ups.Interactive lenses are popular among gamers, so VTAMA created the first AR Lens used as part of a branded pharma campaign. The filter was part of an immersiveSnapchat gamein which users could tap the screen to simulate scratching to jump (itching is a common symptom), and avoid obstacles. Users were encouraged to share their high score with friends, and information about the product was rolled into the game.Over the 24 hours of World Psoriasis Day, the game gathered more than 16,000 clicks and more than 41,000 shares, powering a record-breaking day of website visits for VTAMA that enabled users to find out more about the treatment.VTAMA’s game is clearly branded with the name of a prescription product, but companies who are unable to promote treatments directlycan still combine learning with interactive technology, which is shown to be a great way to make messages stick. Even if the brand isn’t front and centre, finding the right game and platform can still boost consumer knowledge and drive conversations.How pharma brands can get the most from socialSocial media can bring regulatory challenges for pharma and healthcare brands, but that doesn’t mean it can’t play an important marketing role. Here are some ways to make the most of social:Ensure content is relevant and has a clearly defined goal. That might be a rise in sales, but for campaigns that cannot market their products directly, a rise in social engagement or positive sentiment may be key.For more general awareness campaigns,supply educational and patient support contentvia links, and track those links to measure success.Focus on real issues that will resonate– embarrassment around constipation, or a lack of understanding of women’s cardiovascular disease are great examples of conversations that need to be had.Authenticity and trustare particularly important in pharma: being responsive on your social channels is a great start, but as these studies show, using real human stories, respected influencers and expert research gives campaigns a higher chance of success.Don’t be afraid to have fun. Working with a light touch, whether via games or taboo-busting conversation starters, can help brands target different groups of people and underline that pharmaceutical products aren’t just about a condition or its treatment: they’re about helping people live their best life.For more on the role of digital in the healthcare and pharmaceutical industries,visit our sector hub.ByJames SmartMay 29th 202514:59ArticleEMEAHealthcare and PharmaceuticalInfluencer marketingSocial advertisingUKUSVideoShareTwitterFacebookLinkedInEmailRecommendedArticleAI/Machine learningManufacturing and healthcare industries lag in genAI expertise: reportA report by data and AI solutions provider SAS has found that a lack of internal expertise poses a barrier to generative AI adoption – with manufacturing and healthcare among the industries reporting the lowest levels of both internal know-how and usage of GenAI.August 20th 202418:27ArticleEcommerceKaro Healthcare’s Simon Swan on paid search ‘signposting’ and learning from AmazonThe Director of Digital Marketing & Media talks growing retail sales at the consumer healthcare company by learning from D2C brands, avoiding paid search competition and extolling the virtues of simple language.July 2nd 202411:14ArticleSocialTikTok in healthcare: How should pharma marketers approach the platform?From creativity to PMCPA guidance, we talk to Ogilvy Social.Lab’s Dimitri Cologne about what pharma marketers need to consider when adding TikTok to their content strategies.March 24th 202310:56"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://brandequity.economictimes.indiatimes.com/news/advertising/sleepycats-new-ad-campaign-a-bold-call-to-prioritize-sleep/121484042",
    "title": "The wake-up call we all needed: SleepyCat's new ad campaign",
    "content": "Advertising1 min readThe wake-up call we all needed: SleepyCat's new ad campaignSleepyCat's new ad campaign, \"The slap in the face we all need,\" challenges the obsession with productivity by highlighting the importance of sleep. The campaign argues that quality sleep is often overlooked despite elaborate self-care routines. With the tagline #SleepSolvesEverything, the ad aims to reframe sleep as a fundamental necessity for overall well-being, not just a luxury.TelegramFacebookCopy LinkBE StaffETBrandEquityUpdated On May 29, 2025 at 01:05 PM ISTRead by:100 Industry ProfessionalsRead by100 Industry ProfessionalsHighlightsSleepyCat's new advertising campaign delivers a blunt message, emphasising that quality sleep is often overlooked in the pursuit of self-care.The campaign's tagline, #SleepSolvesEverything, positions sleep as a fundamental necessity for health and productivity, rather than a luxury.With a no-nonsense approach, SleepyCat aims to shift perceptions and encourage individuals to prioritise rest amidst a culture focused on productivity.A still from the adIn a world obsessed with productivity and the relentless hustle, a new ad fromSleepyCatis cutting through the noise with a refreshingly blunt message: \"The slap in the face we all need.\" Instead of soft visuals and dreamy promises, the campaign argues that while people go to \"wild lengths forself-care,\" they consistently overlook the most basic and impactful element: sleep.Through its new campaign, the brand is delivering a much-needed reality check, urging one to reconsider thier priorities and finally give sleep the attention it deserves.This ad acts as a straightforward reminder that despite elaborate routines for fitness and appearance, quality sleep remains undervalued. It's a calculated move by SleepyCat to position itself as a brand that champions essential well-being, not just luxury.Advt\"The slap in the face we all need\" aims to shift perception, framing sleep not as a luxury, but as a fundamental necessity for health and productivity. The ad's tagline,#SleepSolvesEverything, concisely conveys this core message.This new campaign marks a distinct, no-nonsense approach for SleepyCat, seeking to cut through the noise with a clear and pointed message about prioritising rest. In an age where genuine connection is increasingly valued, SleepyCat's new ad offers a dose of much-needed honesty.Watch the video here:ByBE Staff,ETBrandEquityPublished On May 29, 2025 at 01:05 PM ISTTelegramFacebookCopy LinkBe the first one to comment.Comment NowCOMMENTSComment NowRead Comment(1)All CommentsBy commenting, you agree to theProhibited Content PolicyPostBy commenting, you agree to theProhibited Content PolicyPostFind this Comment Offensive?Choose your reason below and click on the submit button. This will alert our moderators to take actionsREASONS FOR REPORTINGFoul LanguageDefamatoryInciting hatred against a certain communityOut of Context / SpamOthersReportJoin the community of 2M+ industry professionalsSubscribe to our newsletter to get latest insights & analysis.Download ETBrandEquity AppGet Realtime updatesSave your favourite articlesScan to download AppSleepyCat ad campaignimportance of sleepsleep health benefitsself-caresleep as a necessity#SleepSolvesEverythinghealth and wellness marketingmattress advertisementSleepyCatadvertising"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://www.socialsamosa.com/experts-speak/learning-from-global-mental-health-ads-9315061",
    "title": "Learning from global mental health ads",
    "content": "Experts SpeakLearning from global mental health adsCreative folks say it’s time to move beyond metaphors and polished narratives, because the most powerful mental health ads don’t just inspire, they make people feel seen. As global campaigns lean into emotional clarity and discomfort, can Indian advertising let go of softness and start telling stories that truly connect?Sneha Medda29 May 2025 14:52 ISTFollow UsNew UpdateWhat does a Happy Meal without a smile say?In 2023, McDonald’s UK launched The Meal, a mental health campaign that removed the iconic smile from millions of Happy Meal boxes. No dramatic visuals. No grand tagline. Just one powerful message: it’s okay not to feel happy all the time. Especially for children.For a brand built around joy, this move felt honest and deeply unsettling. It used branding itself as the message, not a distraction from it. “McDonald’s made a bold, visual statement,” saysPrardhana Chillarige, Creative Director at Gozoop Creative. “In a world where brands often over-index on positivity, this campaign dared to lean into discomfort without making it difficult to understand.”And that’s the thing. Many global mental health ads don’t try to simplify the subject. They sit with their discomfort. They speak plainly and directly.Dipshika Ravi, National Creative Director at Schbang, recalls The Last Photo campaign from the UK that showed smiling images of people in the days before they died by suicide. No dramatic voiceover. No emotional manipulation. Just everyday moments, asking us to rethink what we think we know about who’s struggling. “It shattered the stereotype that someone struggling always looks a certain way,” she says. “It made you want to check in on your friends. That’s the kind of impact a campaign should create.”So what happens when we compare this to how Indian brands approach the same subject?We see longer films. Poetic voiceovers. A chai cup, a metaphor, a message that arrives slowly, carefully. In India, mental health is often spoken about in symbols.Mitul Shah, Founder and CCO of Calculated Chaos, puts it bluntly: “Globally: ‘Here’s how I felt. Here’s how I asked for help.’ India: ‘Here’s a 7-minute film where the camera stares into a chai cup while a voiceover reads a poem.’”Why is that?Part of the reason lies in where we are, culturally. Mental health in India is still not a fully mainstream conversation. So when we talk about it in ads, we tend to speak softly, metaphorically. “Indian ads are more layered and indirect,” saysChillarige.“They reflect a cultural lens where mental health is still finding acceptance.”But subtle doesn’t always mean ineffective. Indian campaigns like Mirinda’s #ReleaseThePressure, which used open letters from students to their parents to showcase the mental strain that exams can create on kids.Or Bournvita’s Get The Message campaign, which cleverly showed how we overlook children’s struggles.These campaigns prove that you don’t need shock to move people. You need honesty. Familiarity. Emotional truth.That’s why Dipshika Ravi sees the tide turning. “We’re learning how to strike the right balance between awareness and storytelling,” she says. “Take Zomato’s recent chai campaign—it addressed mental health through something as ordinary as a tea break.”So the question is no longer whether India can talk about mental health. It’s how we choose to do it.Do we dramatise it? Do we dress it up in metaphors? Or can we learn from the restraint and emotional clarity that global campaigns are leaning into?Because if we want our ads to make a difference, they have to do more than make noise. They have to make people feel seen.The creative tightropeFor creatives, the challenge isn’t just inwhatto say, buthowto say it, especially in a country where the audience is emotionally diverse and brands are often hesitant to fully commit.Prardhana Chillarige points out the double bind that creatives often face. “We’re often speaking to two Indias at once: one where mental health is still dismissed with phrases like ‘Aise kuch hota nahi hai’, and another where a younger, more self-aware generation is actively prioritising their emotional wellbeing.”And the result is storytelling that must act as a bridge that is sensitive enough not to alienate, but clear enough to push the conversation forward.And even when the intent exists, the creative freedom doesn’t always follow. Mitul Shah summarises the paradox. “We want to talk about mental health… but nothing dark.” It’s the kind of brief that demands vulnerability, but only the Instagram-friendly kind. “Let mental health ads be awkward, unpolished, maybe even uncomfortable,” Shah says. “That’s what makes them believable.”“There’s also the fear of backlash,” says Dipshika Ravi. “Many brands are hesitant to touch the topic... they want to stay in the space of ‘positivity’, which restricts them from highlighting topics like mental health.”But mental health isn’t always positive. It’s messy. Conflicted. Uneasy. And yet, that’s exactly why it matters. “Mental health isn’t about being inspirational,” Mitul Shah adds. “It’s about being real. And real isn’t always pretty.”For all three creatives, the ask is simple.Let campaigns hold space for discomfort.Don’t sanitise sadness.Don’t reduce anxiety to a metaphor.Don’t script away silence.And most importantly, stop scripting briefs like TED Talks.“What we need,” Dipshika Ravi says, “is not just good storytelling, but honest storytelling. Campaigns that don’t just tick boxes, but allow people to feel seen.”How can creative folks do better?In Indian advertising, conversations around mental health are still in their initial stages. A bit fragile and often surface-level. So, how can the industry push for meaningful mental health narratives in a system that is wierd for brand safety?It begins with intent.Prardhana Chillarige suggests a powerful shift in perspective. She says, “In this age of creating ‘clutter-breaking’ ad campaigns, agencies need to shift their lens from ‘How do we stand out?’ to ‘How do we make someone feel seen?’”This question, ‘how do we make someone feel seen’, is at the heart of every mental health story. And perhaps, that’s what creatives need to remember. You’re not just crafting content; you’re offering someone, somewhere, the comfort of recognition. A moment of human connection. A line, a visual, a scene that makes them think, ‘Oh. I’m not alone in this.’Chillarige adds, “Before we are creatives, we are people—and that’s where the work must begin. Treat mental health not as a campaign, but as a cultural responsibility.”This idea that we are people first is what Dipshika Ravi suggests as well. She urges brands and creatives to ‘listen’ first. Not to win awards. Not to craft a ‘good story’. But to understand. She says, “Speak to people who have lived the experience. Listen without judgment and without the lens of what makes a good ad.”Too often, mental health ads go to extremes, either they’re too dramatic or they feel too polished and distant. Dipshika Ravi offers a different approach, to be subtle and honest. “Let the story do the work… sometimes, the most powerful mental health narratives come from the mundane—like a bad day at work, a lonely lunch, or the silence after a conversation.”It’s in these small, everyday moments that mental health really lives. Not in big breakdowns, but in the quiet in-betweens, the cancelled plans, the long pauses, the feelings we don’t always say out loud. Ads that show these moments truthfully often stay with us the longest.While creatives often lead the way in shaping these stories, Ravi reminds that brands need to be part of the effort too. “Mental health is a universal concern… encourage your brand partners to engage with it meaningfully—you never know the impact it can create.”global mental health adsmental health awarenessGlobal Mental Health awarenesslearnings from mental health adsRead MoreRelated ArticlesRead the Next Article"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://www.storyboard18.com/brand-marketing/virat-kohli-splits-from-puma-yet-still-stars-in-their-latest-campaign-how-67838.htm",
    "title": "Virat Kohli splits from Puma, yet still stars in their latest campaign. How?",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://brandequity.economictimes.indiatimes.com/news/advertising/vidyut-jammwal-shines-in-spykars-chic-denim-campaign-bringing-fashion-and-confidence-to-new-heights/121489175",
    "title": "Vidyut Jammwal reflects a confident new India in Spykar’s new ad",
    "content": "Advertising1 min readVidyut Jammwal reflects a confident new India in Spykar’s new adSpykar, the Indian denim brand, has announced Vidyut Jammwal as the face of its new Chico denim campaign. This partnership highlights Chico's relaxed fit and engineered comfort, aligning with a generation that values authenticity and effortless style. The collaboration reflects Spykar's commitment to reimagining denim for modern lifestyles, blending performance, versatility, and refined aesthetics.TelegramFacebookCopy LinkBE StaffETBrandEquityUpdated On May 29, 2025 at 04:28 PM ISTHighlightsSpykar, India’s homegrown denim brand, has partnered with action star and fitness icon Vidyut Jammwal to launch the Chico Fit, a denim that embodies authenticity and effortless style.Sanjay Vakharia, co-founder and chief executive officer of Spykar, emphasized that the Chico Fit represents the essential elements of style, performance, and purpose in modern denim.Vidyut Jammwal expressed excitement about joining the Spykar community and participating in the Chico campaign, highlighting the collaboration as a celebration of style with purpose.Vidyut JammwalSpykar, India’s homegrowndenimbrand, has welcomed action star andfitness iconVidyut Jammwalto its growing community.Jammwal headlines Spykar’s latest campaign featuring Chico, the most desirable denim in Spykar’s portfolio of fits. With a relaxed silhouette and engineered comfort,Chico Fitreflects a generation that values authenticity, movement, and effortless style, making Jammwal the perfect face for this confident new era, the brand stated in a press note.This partnership brings together two bold forces driven by a shared commitment to self-expression and effortless style, marking a defining moment in Spykar’s journey, it added.AdvtMore than just a style statement, it reflects Spykar’s commitment to reimagining denim for today’s fast-paced, purpose-driven lifestyles, where performance, versatility and refined aesthetics come together to create an everyday essential that feels as good as it looks.Sanjay Vakharia, co-founder and chief executive officer of Spykar said, \"Chico represents everything a denim universe requires - style, performance, and purpose. This collaboration is a powerful step forward in our journey to shape how India wears and owns its identity.\"Spykar teams up with Jammwal to mark a bold new denim era. With his global appeal, fearless style, and stronghold in fitness, Jammwal perfectly embodies the spirit of Chico, desirable, versatile and unapologetically individual.This collaboration reflects a confident new India, where fashion meets individuality.Jammwal said, \"Joining the Spykar community felt like a natural fit for me, and being part of the Chico campaign is an exciting way to celebratestyle with purpose.\"With this collaboration, Spykar continues to strengthen its position as a cultural catalyst inIndian fashioncelebrating those who defy convention and dress with intent.As Spykar and Jammwal come together, the message is clear: when confidence meets comfort, style becomes a statement of purpose.Watch the video here:ByBE Staff,ETBrandEquityPublished On May 29, 2025 at 04:20 PM ISTTelegramFacebookCopy LinkBe the first one to comment.Comment NowCOMMENTSComment NowRead Comment(1)All CommentsBy commenting, you agree to theProhibited Content PolicyPostBy commenting, you agree to theProhibited Content PolicyPostFind this Comment Offensive?Choose your reason below and click on the submit button. This will alert our moderators to take actionsREASONS FOR REPORTINGFoul LanguageDefamatoryInciting hatred against a certain communityOut of Context / SpamOthersReportJoin the community of 2M+ industry professionalsSubscribe to our newsletter to get latest insights & analysis.Download ETBrandEquity AppGet Realtime updatesSave your favourite articlesScan to download AppVidyut JammwalSpykarChico Fitdenimstyle with purposeself-expression in fashionIndian fashionfashion individualityfitness iconcomfortable denim"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://www.campaignindia.in/article/apac-power-list-2025-the-regions-most-powerful-brand-leaders/502784",
    "title": "APAC Power List 2025: The region's most powerful brand leaders",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://www.campaignasia.com/event/the-role-of-brands-in-improving-peoples-lives/502787",
    "title": "The role of brands in improving people’s lives",
    "content": "Main article content not found or too short."
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://bestmediainfo.com/mediainfo/advertising/trust-the-last-mile-rajesh-ramaswamy-the-script-room-9317105",
    "title": "Trust the last mile: Rajesh Ramaswamy, The Script Room",
    "content": "AdvertisingTrust the last mile: Rajesh Ramaswamy, The Script RoomThe suit-turned-creative behind campaigns of Swiggy, Tanishq, Paper Boat, Nykaa and PhonePe, among others, spoke at Advertising Club Madras’ AdTalks WednesdayGokul Krishnamoorthy29 May 2025 14:09 ISTFollow UsNew UpdateListen to this article0.75x1x1.5x00:00/00:00“Yella Ok. Cool drink yaake?”(Everything else is fine, but why the cool drink?)This isn’t just an iconic tagline for UB Export beer, but an immortal punchline for fans of Sandalwood’s ‘Real Star’ Upendra. For the uninitiated, Sandalwood refers to the Kannada film industry. And for those not in the know, the line was penned by a Client Servicing person from what was then JWT, Rajesh Ramaswamy.The humorous campaign film featured Upendra delivering the line to his on-screen girlfriend, as she sips a cool drink with another guy and tells Uppi that she has moved on. All that is fine, but why the cool drink (when you can have UB Export beer at Rs.17?) was the thought.The campaign broke circa 2002 to a massive reception, and the line has become part of popular culture. The writer, after this first accidental campaign, shed his suit and formally moved to the creative side of the agency business.Ramaswamy, or Ramsam as he is called, has worked at several agencies, including Lowe Lintas, besides directing ad films via Coconut Films. The Founder of The Script Room, alongside Ayyappan Raj, also wrote and directed the outfit’s first original short film, Iruve, which was released online last year as they turned five.Ramsam took the audience at Advertising Club Madras’ #AdTalks event on May 28, 2025, through some of his work, gleaning lessons therefrom on the theme ‘Writing for the screen’.“When you are writing for the screen, it’s the beginning, not the end. Take the case of ZooZoos or the Cadbury Girl. It’s fantastic but how much could the writer have written to begin with? It’s one component, the starting point. You have to keep your mind open to everyone and everything. Any one of the many elements of screenwriting – the messaging, protagonist, plot, form, dialogues, music, setting and more – could become the most beautiful part of the process,” explained Ramaswamy, setting the audience up for the audio-visual treat that followed.Drawing from LifeThemes like confidence, self-love and the like were aplenty in the beauty space when Nykaa wanted to make a splash and stand out with a thematic campaign. A brand thought was sought out.Drawing from personal experience helped Ramaswamy. His young daughter generally refused his mother when asked to wear the traditional ‘Pavadai-Sattai’. On one special occasion, she willingly obliged. The grandmother was utterly delighted. At that moment, the grandmother saw the most beautiful version of the young woman. This led to the campaign thought of‘Kya Khoob Lagti Ho’ –beauty as seen by those around you.Agency: The Script Room“React personally, as yourself, and don’t look at what social media is saying. If you have nothing to start with, start as yourself. First, see if it leads you somewhere,” reflected the speaker.The Protagonist pivotAdmittedly, the protagonist has been a big component of Ramaswamy’s ads, which follow a storytelling format, he explained. And the choice of that protagonist can have a telling impact on the final output, as was evident in the cases that were presented.“Whom do you think of when you think of Teacher’s Day? Usually, it is the teacher who is most popular, who gives extra PT classes, and so on. But what about the other guy, who is not remembered on Teacher’s Day?” posed Ramaswamy.That led to the characterisation of the invisible protagonist in Paper Boat’s Teacher’s Day campaign.Agency: MullenLowe Lintas GroupIn another case, the protagonist was a student. A student booking himself into an Oyo to escape the distractions at home and study – clearly an attempt to underline that there are multiple reasons for people to choose the hospitality brand.Agency: The Script RoomThe Form factorWhen Paper Boat, a brand built on nostalgia, wanted to create a campaign, arriving at the approach was a challenge for the team initially, noted Ramaswamy.“We wanted to be creative. We would think of a concept, add a spin, and present it. But the response from the client was,‘Dil pe nahin lag raha hai’. Then we thought, ‘Why are we doing this (spin)?’ Sometimes, if an idea is in its raw form and it hasn’t been done before, you don’t need to add creative layers to it. Sometimes, keeping it as raw and simple as possible can be the best approach. Even Gulzar saab wrote it simply and magically. When this ad came out, using poetry in ads was not common,” explained the speaker. The magic of the Malgudi Days soundtrack punctuated the poetic verse.Agency: MullenLowe Lintas GroupAt other times, one is forced to adopt the form that lends itself to the time available, he noted, with the case of a campaign for Britannia Nutrichoice that had to be completed in a week.Language No BarMaking the case for making the most of India’s linguistic richness, Ramaswamy pointed to advertising that leveraged diversity in dialects as well as in languages.Sometimes, audio-visual stories do not need language. And sometimes, the stories connect across languages, as Ramaswamy demonstrated with work for Tanishq Rivaah.The multi-lingual took a lot of persuasion, he underlined. It was natural for clients to wonder how speakers of one language would react to portions of the ad in other languages. The result must have surprised even the sceptics.Agency: MullenLowe Lintas GroupIn the case of PhonePe, there was no need for language.Agency: The Script RoomA nuanced approachImagine the case of the Fastrack Reflex ad, where a young woman tells a young man working out on the ground, “I can help.” Her offer was to help him meet his calorie-burning target for the day, leaving little room for doubt on the means she had in mind.Agency: MullenLowe Lintas GroupThe brand had always been about the young and was not shy of talking about sex. The agency thought of ways in which to make the ad with the young man making the first move, but had little success. It had to be nuanced and not come across as crass.“One small mistake and this would have become sleazy. We had to think of every little thing. When we gave the female model the water bottle, and when we heard that go ‘pop’ at the sound recording, that’s when we knew this had fallen in place,” explained Ramaswamy.Tone MattersUnderstanding the behaviours of cohorts is not something that’s restricted to planners. Anyone writing for film needs to be wired to capture those images in the script, underlined the speaker.Case in point: A Tanishq film announcing that the range starts at Rs 5,000. The protagonists, a young man and his elder sister, who is about to leave home. The plot, unsurprisingly, is a gift. But the treatment? A priceless slice of life.Agency: MullenLowe Lintas GroupThere are other necessities that shape a script. Like, for instance, a client who wants the film to spell out that one can pay their electricity, water, internet and other bills through the app. That was a given. It had to be incorporated. But how does one do that engagingly?Agency: The Script RoomThe initial thought was that the frustrated father said that he is stepping out to meet his friends. When that didn’t have the required impact, the agency came up with the haircut.In the case of the immortal ‘Swiggy Uncle’ series that debuted during the IPL, the commentary was not originally intrinsic to the script. How that eventually added heft to the series is now the stuff of legend.Agency: MullenLowe Lintas Group“We initially presented two or three ads. But we were told that we needed to have cricketing context because it was to be aired during IPL.Commentary had already been used (as a device) by other brands, so we used commentary that was coincidental to the stories, and also not the usual frenzied commentary. We were initially very pissed that they wanted the cricketing context. It was eventually a blessing that the client wanted us to put in the commentary. Just trust the last mile. Everything happens for good,” surmised Ramaswamy.(The writer is an independent content consultant and marketing columnist.)PhonePePaperBoatTanishqAd ClubNykaaSwiggyRajesh RamaswamyThe Script RoomRead MoreRelated ArticlesRead the Next Article"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "http://buzzincontent.com/insight/a-15-second-reel-could-land-your-brand-in-court-9319959",
    "title": "A 15-second reel could land your brand in court",
    "content": "InsightA 15-second reel could land your brand in courtAs brands gradually move from 30-second TV commercials to 15-second reels, the rules and the risk around music usage have changed drastically. With short-form content taking precedence, music licensing has become a minefieldLalit Kumar30 May 2025 12:09 ISTFollow UsNew UpdateNew Delhi: Music has always been a key ingredient in advertising. It adds flavours of emotions, builds recall, and gives brands a sonic signature that often outlasts visuals.Be it jingles that get attuned to our consciousness or movie songs repurposed, marketers have long used music to create a deeper connection with consumers. And for good reason. According to music licensing platform Hoopr, the right music can drive a 25–35% uptick in content performance.As brands gradually move from 30-second TV commercials to 15-second reels, the rules and the risk around music usage have changed drastically. With short-form content taking precedence, where trends shift daily and creators and influencers push out thousands of videos in real time, music licensing has become a minefield.Brands chasing virality often overlook copyright protocols, mistakenly assuming that a short duration or social media platform automatically makes a track “free to use.” This false sense of immunity is now putting brands, creators, and agencies on the legal radar.A ticking compliance clockMaking sense of the matter, Gaurav Dagaonkar, Co-Founder and CEO, Hoopr, shared staggering numbers in the context of the lack of copyright oversight in India’s booming content landscape. According to Dagaonkar, nearly 1 million units of branded content are produced by more than 80,000 brands and 5,50,00 creators every month.“87% of this lot infringes copyrights, leading to a colossal Rs 8,000 to Rs 10,000 crore loss annually for the Indian music industry. Artists themselves are losing out on up to Rs 900 crore in unpaid royalties,” he said.A top executive of a renowned label in the music industry, who requested anonymity, identifies it as a grave problem. “A major issue is brands using music from platforms like Instagram or YouTube Shorts, assuming it’s free for commercial use. These platforms license music only for user-generated content, not brand campaigns.But many brands still use it without proper licensing, which is clear copyright infringement. We often have to send takedown notices or reach out to platforms to block the content. It’s a growing problem,” the executive told BestMediaInfo.com.The label, upon identifying an infringement, does send notices, and if there is no response from the brand or the creator, a request is made to the platforms, such as Instagram or YouTube, to block the content.“But this is time-consuming and costly, and the ROI is low. By the time we catch it, the brand might’ve already benefited from using the song for months,” the executive from the global label said.Vetting this legally, Sushant Chaturvedi, a Delhi-based legal professional who specialises in media laws, said, “Using music from YouTube/Instagram libraries doesn’t automatically license it for commercial use or branded content.”He further clarified that even a 15-second Reel needed both a sync license (pairing music with visuals) and a master-use license (using a specific recording) if it was commercial.Chiming in, Rajkumar Varier, legal counsel associated with multiple media houses, said, “The mere popularity or viral nature of a track does not amount to it being in the public domain or available for commercial use.When such tracks are used in branded content or influencer campaigns, the use becomes commercial in nature, thus necessitating prior authorisation by way of licensing. Usage without licensing would result in civil and criminal consequences.”Legal landminesVarier explained that when brands endorse or amplify content, whether created by influencers or user-generated content (UGC), that includes unlicensed music, they risk being held liable for copyright infringement.“The rights holder may resort to remedies such as civil remedies of cease and desist, injunctions, damages, takedown from YouTube, Instagram, etc. The rights holder may even resort to criminal remedies under the applicable provisions of the Copyright Act of the Bhartiya Nyay Sanhita.”Dagaonkar stated, “When influencers deploy these tracks without proper licenses, brands can be held directly liable for copyright infringement, facing severe consequences that include costly lawsuits, immediate content takedown requests, and substantial financial sanctions.”Penalties, in such cases, typically range from Rs 2 lakh to Rs 5 crore, varying based on the extent, duration, and commercial nature of the infringement across platforms.“Major music labels are aggressively pursuing legal action, setting expensive precedents that underscore the dangers of non-compliant campaigns. Notable examples include Sony Music's recent petition in the Bombay High Court against Myntra, claiming Rs 5 crore in damages for various copyright breaches,” Dagaonkar told BestMediaInfo.com.Bridging the compliance gapDespite the complexity, experts agreed that compliance need not derail creativity or budgets. They advised treating short-form content as one would any other asset and obtaining sync and master licenses for any track featured in paid or sponsored posts.“To safeguard against copyright violations, brands should include clear contractual clauses requiring creators or influencers to use only music that is original, properly licensed, or royalty-free,” said Varier.He added, “They must also seek warranties and indemnities from the influencer, confirming that all third-party intellectual property used in the content is appropriately licensed and does not infringe any rights.”Chaturvedi insisted on pre-approval of all music before content is published. He suggested brands request proof of licensing wherever third-party music is used.Elaborating on the precautions, Chaturvedi said, “For long-term collaborations or repeat campaigns, periodic audits should be conducted to ensure ongoing compliance.In cases where licensing is geographically or platform-specific, appropriate geo-fencing and platform-fencing measures should be implemented. If licensing payments are not feasible, obtaining a No Objection Certificate (NOC) from the titleholders is essential to mitigate legal risks.”Safe scroll and swipeWhen brands go the right way, the ROI is worth it. As Dagaonkar mentioned, marketers, when they employ popular and trending licensed music, experience 25–35% higher engagement rates, better brand recall, and greater emotional resonance with audiences.“Licensed music, particularly popular Bollywood and regional songs, enables brands to develop culturally appropriate and memorable content that resonates broadly,” Hoopr’s CEO said.And when it comes to digital-first or digital-only branded content, the licensing game is even easier to play. As Dagaonkar explained, “Licensing music for digital-only branded content offers significant cost advantages over traditional linear or TV campaigns.The nature of digital platforms often allows for narrower usage rights, shorter licensing periods, and the applicability of micro-licensing models.”Another thing to factor in is that brands can trade off between licensing a popular track versus investing in original composition for branded content. According to Dagaonkar, brands determine the trade-off by balancing short-term effects from popular songs and long-term value and ownership of original works.“Popular songs have high recall but can raise licensing fees by as much as 80% and have usage limitations, so they are less suitable for scalable or multi-platform campaigns. Original works, on the other hand, provide full rights, creative freedom, and improved ROI in the long term, particularly for brands creating a consistent sound identity.”Royalty-free music is yet another desirable choice for brands that want to stay away from legal trouble. But there also exist a few checkpoints.As per legal experts in the field, when using royalty-free tracks, it is critical to carefully review the licensing agreement to confirm that it permits commercial use, modifications, and redistribution.In the case of music sourced from indie or regional artists, brands should always execute written agreements that clearly define the scope of usage rights, including duration, territory, and exclusivity.This proactive approach helps minimise the risk of facing unexpected high licensing fee demands if the use is later discovered, while also reducing the likelihood of inadvertent copyright infringement.Ultimately, the very agility that makes short-form content so attractive also demands rigorous legal discipline.As digital-first storytelling becomes the norm, brands must reconcile the allure of a catchy 15-second reel with the uncompromising mechanics of copyright law. And in today’s lightning-fast content ecosystem, that single truth could determine whether a brand’s next reel becomes a hit or a headline.branded contentinfluencerscreatorsbrandsReelHooprlicensingmusicadvertisementYouTubeInstagramRead MoreRelated ArticlesRead the Next Article"
  },
  {
    "alert_name": "Google Alert - Brand campaigns",
    "date": "2025-05-30",
    "url": "https://www.campaignlive.co.uk/article/samsung-uk-launches-social-media-review/1919723",
    "title": "Samsung UK launches social media review",
    "content": "Samsung UK launches social media reviewCoolr is the incumbent on the account.by\r\n                            Lucy ShelleySign in to continueSign InEmail addressPasswordStay signed inTrouble signing in?Reset password:Click hereEmail:support@campaignlive.co.ukCall: 020 8267 8121RegisterLimited free articles a monthFree email bulletinsRegister NowSubscribeTo receive full access to Campaign's content including:Unrestricted access to all The Information and The Knowledge contentAccess to Campaign's in-depth features and coveted reports including additional School Reports analysis, the Annual Salary Survey, and supplementary insight from Campaign's Best Places to WorkRegular data-led insight reports from Campaign Red, our new global insights and data intelligence toolSubscribe nowSubscribeUnrestricted access to our most popular content including the School Reports, Power 100 and Best Places to WorkEssential round-ups such as Movers and Shakers, Pitch Update and the Question of the WeekLeading insights from Campaign’s award-winning editorsExplore optionsNeed to activate  your membership?Campaign MembersClick here >>Marketing Society MembersClick here >>"
  }
]